[Killed] String mutation
src/RailManager.Interfaces/Data/FluentVersion.cs:29:47
     public override string ToString() =>
         Operator switch {
             VersionOperator.Equal          => "",
-            VersionOperator.GreaterThan    => ">",
+            VersionOperator.GreaterThan    => "",
             VersionOperator.GreaterOrEqual => ">=",
             VersionOperator.LessOrEqual    => "<=",
killedBy: RailManager.Interfaces.Tests.Data.TestsFluentVersion.ToStringTest
