[Killed] Null coalescing mutation (remove left)
RailManager/src/RailManagerInstaller/GameDirectoryResolver.cs:17:16
     public static Func<IAssembly, string?> TryResolveGameDirectory = TryResolveGameDirectoryCore;
 
     public static string? TryResolveGameDirectoryCore(IAssembly executingAssembly) {
-        return CheckCurrentDirectory() ??
-               CheckExecutingAssemblyLocation(executingAssembly) ??
-               ResolveGameDirectoryFromRegistry();
+        return CheckExecutingAssemblyLocation(executingAssembly) ??
+               ResolveGameDirectoryFromRegistry();
     }
 
killedBy: RailManagerInstaller.Tests.TestGameDirectoryResolver.TryResolveGameDirectory_CurrentDirectory; RailManagerInstaller.Tests.TestGameDirectoryResolver.TryResolveGameDirectory_ExecutingAssemblyLocation; RailManagerInstaller.Tests.TestGameDirectoryResolver.TryResolveGameDirectory_Null

[Killed] Null coalescing mutation (remove right)
RailManager/src/RailManagerInstaller/GameDirectoryResolver.cs:17:16
     public static Func<IAssembly, string?> TryResolveGameDirectory = TryResolveGameDirectoryCore;
 
     public static string? TryResolveGameDirectoryCore(IAssembly executingAssembly) {
-        return CheckCurrentDirectory() ??
-               CheckExecutingAssemblyLocation(executingAssembly) ??
-               ResolveGameDirectoryFromRegistry();
+        return CheckCurrentDirectory();
     }
 
killedBy: RailManagerInstaller.Tests.TestGameDirectoryResolver.TryResolveGameDirectory_CurrentDirectory; RailManagerInstaller.Tests.TestGameDirectoryResolver.TryResolveGameDirectory_ExecutingAssemblyLocation; RailManagerInstaller.Tests.TestGameDirectoryResolver.TryResolveGameDirectory_Null

[Killed] Null coalescing mutation (remove right)
RailManager/src/RailManagerInstaller/GameDirectoryResolver.cs:18:16
 
     public static string? TryResolveGameDirectoryCore(IAssembly executingAssembly) {
         return CheckCurrentDirectory() ??
-               CheckExecutingAssemblyLocation(executingAssembly) ??
-               ResolveGameDirectoryFromRegistry();
+               CheckExecutingAssemblyLocation(executingAssembly);
     }
 
killedBy: RailManagerInstaller.Tests.TestGameDirectoryResolver.TryResolveGameDirectory_ExecutingAssemblyLocation

[Killed] Null coalescing mutation (left to right)
RailManager/src/RailManagerInstaller/GameDirectoryResolver.cs:18:16
 
     public static string? TryResolveGameDirectoryCore(IAssembly executingAssembly) {
         return CheckCurrentDirectory() ??
-               CheckExecutingAssemblyLocation(executingAssembly) ??
-               ResolveGameDirectoryFromRegistry();
+               ResolveGameDirectoryFromRegistry()??
+               CheckExecutingAssemblyLocation(executingAssembly);
     }
 
killedBy: RailManagerInstaller.Tests.TestGameDirectoryResolver.TryResolveGameDirectory_ExecutingAssemblyLocation; RailManagerInstaller.Tests.TestGameDirectoryResolver.TryResolveGameDirectory_Null; RailManagerInstaller.Tests.TestGameDirectoryResolver.TryResolveGameDirectory_SteamPath

[Killed] Block removal mutation
RailManager/src/RailManagerInstaller/GameDirectoryResolver.cs:24:83
 
     public static string? CheckCurrentDirectory() {
         var currentDirectory = AppServices.Directory.GetCurrentDirectory();
-        if (!AppServices.File.Exists(Path.Combine(currentDirectory, Railroader))) {
-            return null;
-        }
+        if (!AppServices.File.Exists(Path.Combine(currentDirectory, Railroader))) {}
 
         AppServices.Console.WriteLine("Found Railroader in the current working directory.");
killedBy: RailManagerInstaller.Tests.TestGameDirectoryResolver.TryResolveGameDirectory_ExecutingAssemblyLocation; RailManagerInstaller.Tests.TestGameDirectoryResolver.CheckCurrentDirectory_Fails; RailManagerInstaller.Tests.TestGameDirectoryResolver.TryResolveGameDirectory_Null

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
RailManager/src/RailManagerInstaller/GameDirectoryResolver.cs:24:13
 
     public static string? CheckCurrentDirectory() {
         var currentDirectory = AppServices.Directory.GetCurrentDirectory();
-        if (!AppServices.File.Exists(Path.Combine(currentDirectory, Railroader))) {
+        if (AppServices.File.Exists(Path.Combine(currentDirectory, Railroader))) {
             return null;
         }
killedBy: RailManagerInstaller.Tests.TestGameDirectoryResolver.TryResolveGameDirectory_CurrentDirectory; RailManagerInstaller.Tests.TestGameDirectoryResolver.TryResolveGameDirectory_ExecutingAssemblyLocation; RailManagerInstaller.Tests.TestGameDirectoryResolver.CheckCurrentDirectory_Fails

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/GameDirectoryResolver.cs:28:9
             return null;
         }
 
-        AppServices.Console.WriteLine("Found Railroader in the current working directory.");
+        ;
         return currentDirectory;
     }
killedBy: RailManagerInstaller.Tests.TestGameDirectoryResolver.TryResolveGameDirectory_CurrentDirectory; RailManagerInstaller.Tests.TestGameDirectoryResolver.CheckCurrentDirectory_Succeed

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
RailManager/src/RailManagerInstaller/GameDirectoryResolver.cs:34:13
 
     public static string? CheckExecutingAssemblyLocation(IAssembly executingAssembly) {
         var path = Path.GetDirectoryName(executingAssembly.Location)!;
-        if (!AppServices.File.Exists(Path.Combine(path, Railroader))) {
+        if (AppServices.File.Exists(Path.Combine(path, Railroader))) {
             return null;
         }
killedBy: RailManagerInstaller.Tests.TestGameDirectoryResolver.TryResolveGameDirectory_ExecutingAssemblyLocation; RailManagerInstaller.Tests.TestGameDirectoryResolver.CheckExecutingAssemblyLocation_Succeed; RailManagerInstaller.Tests.TestGameDirectoryResolver.TryResolveGameDirectory_Null

[Killed] Block removal mutation
RailManager/src/RailManagerInstaller/GameDirectoryResolver.cs:34:71
 
     public static string? CheckExecutingAssemblyLocation(IAssembly executingAssembly) {
         var path = Path.GetDirectoryName(executingAssembly.Location)!;
-        if (!AppServices.File.Exists(Path.Combine(path, Railroader))) {
-            return null;
-        }
+        if (!AppServices.File.Exists(Path.Combine(path, Railroader))) {}
 
         AppServices.Console.WriteLine($"Found Railroader in the {executingAssembly.GetName().Name} assembly directory.");
killedBy: RailManagerInstaller.Tests.TestGameDirectoryResolver.TryResolveGameDirectory_Null; RailManagerInstaller.Tests.TestGameDirectoryResolver.TryResolveGameDirectory_SteamPath; RailManagerInstaller.Tests.TestGameDirectoryResolver.CheckExecutingAssemblyLocation_Fails

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/GameDirectoryResolver.cs:38:9
             return null;
         }
 
-        AppServices.Console.WriteLine($"Found Railroader in the {executingAssembly.GetName().Name} assembly directory.");
+        ;
         return path;
     }
killedBy: RailManagerInstaller.Tests.TestGameDirectoryResolver.TryResolveGameDirectory_ExecutingAssemblyLocation; RailManagerInstaller.Tests.TestGameDirectoryResolver.CheckExecutingAssemblyLocation_Succeed

[Killed] String mutation
RailManager/src/RailManagerInstaller/GameDirectoryResolver.cs:38:39
             return null;
         }
 
-        AppServices.Console.WriteLine($"Found Railroader in the {executingAssembly.GetName().Name} assembly directory.");
+        AppServices.Console.WriteLine($"");
         return path;
     }
killedBy: RailManagerInstaller.Tests.TestGameDirectoryResolver.TryResolveGameDirectory_ExecutingAssemblyLocation; RailManagerInstaller.Tests.TestGameDirectoryResolver.CheckExecutingAssemblyLocation_Succeed

[Killed] Equality mutation
RailManager/src/RailManagerInstaller/GameDirectoryResolver.cs:45:13
     [System.Diagnostics.CodeAnalysis.SuppressMessage("ReSharper", "StringLiteralTypo")]
     public static string? ResolveGameDirectoryFromRegistry() {
         using var registryKey = AppServices.Registry.CurrentUser.OpenSubKey(@"SOFTWARE\Valve\Steam");
-        if (registryKey == null) {
+        if (registryKey != null) {
             throw new ArgumentException("Cannot find Steam registry");
         }
killedBy: RailManagerInstaller.Tests.TestGameDirectoryResolver.ResolveGameDirectory_ReturnsPathFromVdf; RailManagerInstaller.Tests.TestGameDirectoryResolver.ResolveGameDirectory_EmptyVdf; RailManagerInstaller.Tests.TestGameDirectoryResolver.ResolveGameDirectory_InvalidVdf_NoLibraryFolders

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/GameDirectoryResolver.cs:46:13
     public static string? ResolveGameDirectoryFromRegistry() {
         using var registryKey = AppServices.Registry.CurrentUser.OpenSubKey(@"SOFTWARE\Valve\Steam");
         if (registryKey == null) {
-            throw new ArgumentException("Cannot find Steam registry");
+            ;
         }
 
killedBy: RailManagerInstaller.Tests.TestGameDirectoryResolver.ResolveGameDirectoryFromRegistry_RegistryNotFound_ThrowsCannotFindSteamRegistry

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
RailManager/src/RailManagerInstaller/GameDirectoryResolver.cs:50:34
         }
 
         var steamPath = registryKey.GetValue("SteamPath") as string;
-        if (steamPath == null || !AppServices.Directory.Exists(steamPath)) {
+        if (steamPath == null || AppServices.Directory.Exists(steamPath)) {
             throw new ArgumentException("Steam path not found, or does not exist on file system");
         }
killedBy: RailManagerInstaller.Tests.TestGameDirectoryResolver.ResolveGameDirectory_ReturnsPathFromVdf; RailManagerInstaller.Tests.TestGameDirectoryResolver.ResolveGameDirectory_EmptyVdf; RailManagerInstaller.Tests.TestGameDirectoryResolver.ResolveGameDirectory_InvalidVdf_NoLibraryFolders

[Killed] Equality mutation
RailManager/src/RailManagerInstaller/GameDirectoryResolver.cs:50:13
         }
 
         var steamPath = registryKey.GetValue("SteamPath") as string;
-        if (steamPath == null || !AppServices.Directory.Exists(steamPath)) {
+        if (steamPath != null || !AppServices.Directory.Exists(steamPath)) {
             throw new ArgumentException("Steam path not found, or does not exist on file system");
         }
killedBy: RailManagerInstaller.Tests.TestGameDirectoryResolver.ResolveGameDirectory_ReturnsPathFromVdf; RailManagerInstaller.Tests.TestGameDirectoryResolver.ResolveGameDirectory_EmptyVdf; RailManagerInstaller.Tests.TestGameDirectoryResolver.ResolveGameDirectory_InvalidVdf_NoLibraryFolders

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/GameDirectoryResolver.cs:51:13
 
         var steamPath = registryKey.GetValue("SteamPath") as string;
         if (steamPath == null || !AppServices.Directory.Exists(steamPath)) {
-            throw new ArgumentException("Steam path not found, or does not exist on file system");
+            ;
         }
 
killedBy: RailManagerInstaller.Tests.TestGameDirectoryResolver.ResolveGameDirectory_SteamPathValueIsNotValidDirectoryPath_ThrowsSteamPathNotFound; RailManagerInstaller.Tests.TestGameDirectoryResolver.ResolveGameDirectory_SteamPathValueIsNotString_ThrowsSteamPathNotFound

[Killed] String mutation
RailManager/src/RailManagerInstaller/GameDirectoryResolver.cs:51:41
 
         var steamPath = registryKey.GetValue("SteamPath") as string;
         if (steamPath == null || !AppServices.Directory.Exists(steamPath)) {
-            throw new ArgumentException("Steam path not found, or does not exist on file system");
+            throw new ArgumentException("");
         }
 
killedBy: RailManagerInstaller.Tests.TestGameDirectoryResolver.ResolveGameDirectory_SteamPathValueIsNotValidDirectoryPath_ThrowsSteamPathNotFound; RailManagerInstaller.Tests.TestGameDirectoryResolver.ResolveGameDirectory_SteamPathValueIsNotString_ThrowsSteamPathNotFound

[Killed] Equality mutation
RailManager/src/RailManagerInstaller/GameDirectoryResolver.cs:62:17
         
 
         foreach (var libraryFolder in libraryFolders.Values.OfType<VdfEntry>()) {
-            if (libraryFolder.FindValue<VdfEntry>("apps")?.ContainsKey("1683150") != true) {
+            if (libraryFolder.FindValue<VdfEntry>("apps")?.ContainsKey("1683150") == true) {
                 continue;
             }
killedBy: RailManagerInstaller.Tests.TestGameDirectoryResolver.ResolveGameDirectory_ReturnsPathFromVdf; RailManagerInstaller.Tests.TestGameDirectoryResolver.ResolveGameDirectory_InvalidVdf_NoPathInApps; RailManagerInstaller.Tests.TestGameDirectoryResolver.TryResolveGameDirectory_SteamPath

[Killed] Boolean mutation
RailManager/src/RailManagerInstaller/GameDirectoryResolver.cs:62:86
         
 
         foreach (var libraryFolder in libraryFolders.Values.OfType<VdfEntry>()) {
-            if (libraryFolder.FindValue<VdfEntry>("apps")?.ContainsKey("1683150") != true) {
+            if (libraryFolder.FindValue<VdfEntry>("apps")?.ContainsKey("1683150") != false) {
                 continue;
             }
killedBy: RailManagerInstaller.Tests.TestGameDirectoryResolver.ResolveGameDirectory_ReturnsPathFromVdf; RailManagerInstaller.Tests.TestGameDirectoryResolver.ResolveGameDirectory_InvalidVdf_NoPathInApps; RailManagerInstaller.Tests.TestGameDirectoryResolver.TryResolveGameDirectory_SteamPath

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/GameDirectoryResolver.cs:63:17
 
         foreach (var libraryFolder in libraryFolders.Values.OfType<VdfEntry>()) {
             if (libraryFolder.FindValue<VdfEntry>("apps")?.ContainsKey("1683150") != true) {
-                continue;
+                ;
             }
 
killedBy: RailManagerInstaller.Tests.TestGameDirectoryResolver.TryResolveGameDirectory_SteamPath; RailManagerInstaller.Tests.TestGameDirectoryResolver.ResolveGameDirectory_InvalidVdf_NoRailroaderIdInApps; RailManagerInstaller.Tests.TestGameDirectoryResolver.ResolveGameDirectory_InvalidVdf_NoAppsInLibraryFolders

[Killed] Conditional (true) mutation
RailManager/src/RailManagerInstaller/GameDirectoryResolver.cs:67:20
             }
 
             var path = libraryFolder.FindValue<string>("path");
-            return path != null
-                ? Path.Combine(path, "steamapps", "common", "Railroader")
-                : throw new VdfException("Path not found");
+            return (true?Path.Combine(path, "steamapps", "common", "Railroader")
+:throw new VdfException("Path not found"));
         }
 
killedBy: RailManagerInstaller.Tests.TestGameDirectoryResolver.ResolveGameDirectory_InvalidVdf_NoPathInApps

[Killed] Conditional (false) mutation
RailManager/src/RailManagerInstaller/GameDirectoryResolver.cs:67:20
             }
 
             var path = libraryFolder.FindValue<string>("path");
-            return path != null
-                ? Path.Combine(path, "steamapps", "common", "Railroader")
-                : throw new VdfException("Path not found");
+            return (false?Path.Combine(path, "steamapps", "common", "Railroader")
+:throw new VdfException("Path not found"));
         }
 
killedBy: RailManagerInstaller.Tests.TestGameDirectoryResolver.ResolveGameDirectory_ReturnsPathFromVdf

[Killed] String mutation
RailManager/src/RailManagerInstaller/GameDirectoryResolver.cs:68:51
 
             var path = libraryFolder.FindValue<string>("path");
             return path != null
-                ? Path.Combine(path, "steamapps", "common", "Railroader")
+                ? Path.Combine(path, "steamapps", "", "Railroader")
                 : throw new VdfException("Path not found");
         }
killedBy: RailManagerInstaller.Tests.TestGameDirectoryResolver.ResolveGameDirectory_ReturnsPathFromVdf
