[Killed] String mutation
RailManager/src/RailManagerInstaller/Patcher.cs:23:78
     
     public static void PatchGameCore() {
 
-        var path = Path.Combine(AppServices.Directory.GetCurrentDirectory(), "Railroader_Data", "Managed");
+        var path = Path.Combine(AppServices.Directory.GetCurrentDirectory(), "", "Managed");
         var modInterfaces = GetFile(path, ModManagerInterfaces + ".dll");
         var modInjector = GetFile(path, ModManager + ".dll");
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenBootstrapMethodMissing_ThrowsInstallerException; RailManagerInstaller.Tests.TestsPatcher.WhenImportReferenceThrows_ThrowsInstallerException; RailManagerInstaller.Tests.TestsPatcher.WhenAlreadyPatched_WritesAlreadyPatchedMessageAndExits

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Patcher.cs:29:9
         var assemblyCsharp = GetFile(path, AssemblyCsharpDll);
 
         var resolver = new DefaultAssemblyResolver();
-        resolver.RemoveSearchDirectory(".");
+        ;
         resolver.RemoveSearchDirectory("bin");
         resolver.AddSearchDirectory(path);
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenAssemblyResolverNotConfigured_ReadModuleThrows

[Killed] String mutation
RailManager/src/RailManagerInstaller/Patcher.cs:29:40
         var assemblyCsharp = GetFile(path, AssemblyCsharpDll);
 
         var resolver = new DefaultAssemblyResolver();
-        resolver.RemoveSearchDirectory(".");
+        resolver.RemoveSearchDirectory("");
         resolver.RemoveSearchDirectory("bin");
         resolver.AddSearchDirectory(path);
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenAssemblyResolverNotConfigured_ReadModuleThrows

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Patcher.cs:30:9
 
         var resolver = new DefaultAssemblyResolver();
         resolver.RemoveSearchDirectory(".");
-        resolver.RemoveSearchDirectory("bin");
+        ;
         resolver.AddSearchDirectory(path);
 
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenAssemblyResolverNotConfigured_ReadModuleThrows

[Killed] String mutation
RailManager/src/RailManagerInstaller/Patcher.cs:30:40
 
         var resolver = new DefaultAssemblyResolver();
         resolver.RemoveSearchDirectory(".");
-        resolver.RemoveSearchDirectory("bin");
+        resolver.RemoveSearchDirectory("");
         resolver.AddSearchDirectory(path);
 
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenAssemblyResolverNotConfigured_ReadModuleThrows

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Patcher.cs:31:9
         var resolver = new DefaultAssemblyResolver();
         resolver.RemoveSearchDirectory(".");
         resolver.RemoveSearchDirectory("bin");
-        resolver.AddSearchDirectory(path);
+        ;
 
         var readerParameters = new ReaderParameters {
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenAssemblyResolverNotConfigured_ReadModuleThrows

[Killed] Boolean mutation
RailManager/src/RailManagerInstaller/Patcher.cs:34:24
         resolver.AddSearchDirectory(path);
 
         var readerParameters = new ReaderParameters {
-            InMemory = true,
+            InMemory = false,
             AssemblyResolver = resolver
         };
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenAssemblyResolverNotConfigured_ReadModuleThrows

[Killed] Negate expression
RailManager/src/RailManagerInstaller/Patcher.cs:41:13
         
         
         var assemblyCsharpModule = AppServices.ModuleDefinition.ReadModule(assemblyCsharp, readerParameters);
-        if (assemblyCsharpModule.AssemblyReferences.Any(o => o.Name == ModManager)) {
+        if (!(assemblyCsharpModule.AssemblyReferences.Any(o => o.Name == ModManager))) {
             AppServices.Console.WriteLine("Railroader is already patched.", ConsoleColor.DarkYellow);
             return;
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenBootstrapMethodMissing_ThrowsInstallerException; RailManagerInstaller.Tests.TestsPatcher.WhenImportReferenceThrows_ThrowsInstallerException; RailManagerInstaller.Tests.TestsPatcher.WhenAlreadyPatched_WritesAlreadyPatchedMessageAndExits

[Killed] Equality mutation
RailManager/src/RailManagerInstaller/Patcher.cs:41:62
         
         
         var assemblyCsharpModule = AppServices.ModuleDefinition.ReadModule(assemblyCsharp, readerParameters);
-        if (assemblyCsharpModule.AssemblyReferences.Any(o => o.Name == ModManager)) {
+        if (assemblyCsharpModule.AssemblyReferences.Any(o => o.Name != ModManager)) {
             AppServices.Console.WriteLine("Railroader is already patched.", ConsoleColor.DarkYellow);
             return;
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenAlreadyPatched_WritesAlreadyPatchedMessageAndExits

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Patcher.cs:42:13
         
         var assemblyCsharpModule = AppServices.ModuleDefinition.ReadModule(assemblyCsharp, readerParameters);
         if (assemblyCsharpModule.AssemblyReferences.Any(o => o.Name == ModManager)) {
-            AppServices.Console.WriteLine("Railroader is already patched.", ConsoleColor.DarkYellow);
+            ;
             return;
         }
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenAlreadyPatched_WritesAlreadyPatchedMessageAndExits

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Patcher.cs:43:13
         var assemblyCsharpModule = AppServices.ModuleDefinition.ReadModule(assemblyCsharp, readerParameters);
         if (assemblyCsharpModule.AssemblyReferences.Any(o => o.Name == ModManager)) {
             AppServices.Console.WriteLine("Railroader is already patched.", ConsoleColor.DarkYellow);
-            return;
+            ;
         }
 
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenAlreadyPatched_WritesAlreadyPatchedMessageAndExits

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Patcher.cs:46:9
             return;
         }
 
-        InjectModule(assemblyCsharpModule, ModManagerInterfaces, modInterfaces, readerParameters);
+        ;
         var modManager = InjectModule(assemblyCsharpModule, ModManager, modInjector, readerParameters);
 
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenBootstrapMethodMissing_ThrowsInstallerException; RailManagerInstaller.Tests.TestsPatcher.WhenImportReferenceThrows_ThrowsInstallerException; RailManagerInstaller.Tests.TestsPatcher.WhenLogManagerTypeMissing_ThrowsInstallerException

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
RailManager/src/RailManagerInstaller/Patcher.cs:50:13
         var modManager = InjectModule(assemblyCsharpModule, ModManager, modInjector, readerParameters);
 
         var hasPatch = PatchLogManager(assemblyCsharpModule, modManager);
-        if (!hasPatch) {
+        if (hasPatch) {
             return;
         }
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenCctorAlreadyCallsBootstrap_SkipsPatch; RailManagerInstaller.Tests.TestsPatcher.WhenCctorExistsButEmpty_InsertsCallBeforeRet; RailManagerInstaller.Tests.TestsPatcher.WhenCctorNotFound_CreatesCctorAndPatches

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Patcher.cs:51:13
 
         var hasPatch = PatchLogManager(assemblyCsharpModule, modManager);
         if (!hasPatch) {
-            return;
+            ;
         }
 
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenCctorAlreadyCallsBootstrap_SkipsPatch

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Patcher.cs:54:9
             return;
         }
 
-        AppServices.File.Copy(assemblyCsharp, assemblyCsharp.Replace(".dll", "_original.dll"));
+        ;
         assemblyCsharpModule.Write(assemblyCsharp);
         AppServices.File.SetLastWriteTime(assemblyCsharp.Replace(".dll", "_original.dll"), AppServices.File.GetLastWriteTime(assemblyCsharp));
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenCctorExistsButEmpty_InsertsCallBeforeRet; RailManagerInstaller.Tests.TestsPatcher.WhenCctorNotFound_CreatesCctorAndPatches; RailManagerInstaller.Tests.TestsPatcher.WhenCctorAlreadyCallsDifferentMethod_DoesNotSkipPatch

[Killed] String mutation
RailManager/src/RailManagerInstaller/Patcher.cs:54:78
             return;
         }
 
-        AppServices.File.Copy(assemblyCsharp, assemblyCsharp.Replace(".dll", "_original.dll"));
+        AppServices.File.Copy(assemblyCsharp, assemblyCsharp.Replace(".dll", ""));
         assemblyCsharpModule.Write(assemblyCsharp);
         AppServices.File.SetLastWriteTime(assemblyCsharp.Replace(".dll", "_original.dll"), AppServices.File.GetLastWriteTime(assemblyCsharp));
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenCctorExistsButEmpty_InsertsCallBeforeRet; RailManagerInstaller.Tests.TestsPatcher.WhenCctorNotFound_CreatesCctorAndPatches; RailManagerInstaller.Tests.TestsPatcher.WhenCctorAlreadyCallsDifferentMethod_DoesNotSkipPatch

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Patcher.cs:55:9
         }
 
         AppServices.File.Copy(assemblyCsharp, assemblyCsharp.Replace(".dll", "_original.dll"));
-        assemblyCsharpModule.Write(assemblyCsharp);
+        ;
         AppServices.File.SetLastWriteTime(assemblyCsharp.Replace(".dll", "_original.dll"), AppServices.File.GetLastWriteTime(assemblyCsharp));
         AppServices.Console.WriteLine("Successfully patched game.");
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenCctorExistsButEmpty_InsertsCallBeforeRet; RailManagerInstaller.Tests.TestsPatcher.WhenCctorNotFound_CreatesCctorAndPatches; RailManagerInstaller.Tests.TestsPatcher.WhenCctorAlreadyCallsDifferentMethod_DoesNotSkipPatch

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Patcher.cs:56:9
 
         AppServices.File.Copy(assemblyCsharp, assemblyCsharp.Replace(".dll", "_original.dll"));
         assemblyCsharpModule.Write(assemblyCsharp);
-        AppServices.File.SetLastWriteTime(assemblyCsharp.Replace(".dll", "_original.dll"), AppServices.File.GetLastWriteTime(assemblyCsharp));
+        ;
         AppServices.Console.WriteLine("Successfully patched game.");
     }
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenCctorExistsButEmpty_InsertsCallBeforeRet; RailManagerInstaller.Tests.TestsPatcher.WhenCctorNotFound_CreatesCctorAndPatches; RailManagerInstaller.Tests.TestsPatcher.WhenCctorAlreadyCallsDifferentMethod_DoesNotSkipPatch

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Patcher.cs:57:9
         AppServices.File.Copy(assemblyCsharp, assemblyCsharp.Replace(".dll", "_original.dll"));
         assemblyCsharpModule.Write(assemblyCsharp);
         AppServices.File.SetLastWriteTime(assemblyCsharp.Replace(".dll", "_original.dll"), AppServices.File.GetLastWriteTime(assemblyCsharp));
-        AppServices.Console.WriteLine("Successfully patched game.");
+        ;
     }
 
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenCctorExistsButEmpty_InsertsCallBeforeRet; RailManagerInstaller.Tests.TestsPatcher.WhenCctorNotFound_CreatesCctorAndPatches; RailManagerInstaller.Tests.TestsPatcher.WhenCctorAlreadyCallsDifferentMethod_DoesNotSkipPatch

[Killed] String mutation
RailManager/src/RailManagerInstaller/Patcher.cs:57:39
         AppServices.File.Copy(assemblyCsharp, assemblyCsharp.Replace(".dll", "_original.dll"));
         assemblyCsharpModule.Write(assemblyCsharp);
         AppServices.File.SetLastWriteTime(assemblyCsharp.Replace(".dll", "_original.dll"), AppServices.File.GetLastWriteTime(assemblyCsharp));
-        AppServices.Console.WriteLine("Successfully patched game.");
+        AppServices.Console.WriteLine("");
     }
 
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenCctorExistsButEmpty_InsertsCallBeforeRet; RailManagerInstaller.Tests.TestsPatcher.WhenCctorNotFound_CreatesCctorAndPatches; RailManagerInstaller.Tests.TestsPatcher.WhenCctorAlreadyCallsDifferentMethod_DoesNotSkipPatch

[Killed] Equality mutation
RailManager/src/RailManagerInstaller/Patcher.cs:64:13
         // Use Mono.Cecil to create static constructor on Logging.LogManager type that calls Railroader.ModManager.ModManager.Bootstrap()
 
         var logManager = assemblyCsharp.GetType("Logging.LogManager");
-        if (logManager == null) {
+        if (logManager != null) {
             throw new InstallerException("Could not find Logging.LogManager type.");
         }
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenBootstrapMethodMissing_ThrowsInstallerException; RailManagerInstaller.Tests.TestsPatcher.WhenImportReferenceThrows_ThrowsInstallerException; RailManagerInstaller.Tests.TestsPatcher.WhenLogManagerTypeMissing_ThrowsInstallerException

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Patcher.cs:65:13
 
         var logManager = assemblyCsharp.GetType("Logging.LogManager");
         if (logManager == null) {
-            throw new InstallerException("Could not find Logging.LogManager type.");
+            ;
         }
 
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenLogManagerTypeMissing_ThrowsInstallerException

[Killed] Equality mutation
RailManager/src/RailManagerInstaller/Patcher.cs:69:13
         }
 
         var modManagerType = modManager.GetType(ModManagerType);
-        if (modManagerType == null) {
+        if (modManagerType != null) {
             throw new InstallerException($"Could not find {ModManagerType} type.");
         }
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenBootstrapMethodMissing_ThrowsInstallerException; RailManagerInstaller.Tests.TestsPatcher.WhenImportReferenceThrows_ThrowsInstallerException; RailManagerInstaller.Tests.TestsPatcher.WhenCctorAlreadyCallsBootstrap_SkipsPatch

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Patcher.cs:70:13
 
         var modManagerType = modManager.GetType(ModManagerType);
         if (modManagerType == null) {
-            throw new InstallerException($"Could not find {ModManagerType} type.");
+            ;
         }
 
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenModManagerTypeMissing_ThrowsInstallerException

[Killed] Equality mutation
RailManager/src/RailManagerInstaller/Patcher.cs:73:74
             throw new InstallerException($"Could not find {ModManagerType} type.");
         }
 
-        var bootstrapMethod = modManagerType.Methods.FirstOrDefault(m => m.Name == "Bootstrap");
+        var bootstrapMethod = modManagerType.Methods.FirstOrDefault(m => m.Name != "Bootstrap");
         if (bootstrapMethod == null) {
             throw new InstallerException($"Could not find {ModManagerType}.Bootstrap method.");
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenImportReferenceThrows_ThrowsInstallerException; RailManagerInstaller.Tests.TestsPatcher.WhenCctorAlreadyCallsBootstrap_SkipsPatch; RailManagerInstaller.Tests.TestsPatcher.WhenCctorExistsButEmpty_InsertsCallBeforeRet

[Killed] Linq method mutation (FirstOrDefault() to First())
RailManager/src/RailManagerInstaller/Patcher.cs:73:31
             throw new InstallerException($"Could not find {ModManagerType} type.");
         }
 
-        var bootstrapMethod = modManagerType.Methods.FirstOrDefault(m => m.Name == "Bootstrap");
+        var bootstrapMethod = modManagerType.Methods.First(m => m.Name == "Bootstrap");
         if (bootstrapMethod == null) {
             throw new InstallerException($"Could not find {ModManagerType}.Bootstrap method.");
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenBootstrapMethodMissing_ThrowsInstallerException

[Killed] Equality mutation
RailManager/src/RailManagerInstaller/Patcher.cs:74:13
         }
 
         var bootstrapMethod = modManagerType.Methods.FirstOrDefault(m => m.Name == "Bootstrap");
-        if (bootstrapMethod == null) {
+        if (bootstrapMethod != null) {
             throw new InstallerException($"Could not find {ModManagerType}.Bootstrap method.");
         }
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenBootstrapMethodMissing_ThrowsInstallerException; RailManagerInstaller.Tests.TestsPatcher.WhenImportReferenceThrows_ThrowsInstallerException; RailManagerInstaller.Tests.TestsPatcher.WhenCctorAlreadyCallsBootstrap_SkipsPatch

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Patcher.cs:75:13
 
         var bootstrapMethod = modManagerType.Methods.FirstOrDefault(m => m.Name == "Bootstrap");
         if (bootstrapMethod == null) {
-            throw new InstallerException($"Could not find {ModManagerType}.Bootstrap method.");
+            ;
         }
 
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenBootstrapMethodMissing_ThrowsInstallerException

[Killed] Linq method mutation (FirstOrDefault() to First())
RailManager/src/RailManagerInstaller/Patcher.cs:81:21
         // Import Bootstrap method
         var bootstrapMethodRef = assemblyCsharp.ImportReference(bootstrapMethod);
 
-        var cctor = logManager.Methods.FirstOrDefault(m => m.Name == ".cctor");
+        var cctor = logManager.Methods.First(m => m.Name == ".cctor");
         if (cctor != null) {
             // Check if Bootstrap is already called
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenCctorNotFound_CreatesCctorAndPatches

[Killed] Equality mutation
RailManager/src/RailManagerInstaller/Patcher.cs:81:60
         // Import Bootstrap method
         var bootstrapMethodRef = assemblyCsharp.ImportReference(bootstrapMethod);
 
-        var cctor = logManager.Methods.FirstOrDefault(m => m.Name == ".cctor");
+        var cctor = logManager.Methods.FirstOrDefault(m => m.Name != ".cctor");
         if (cctor != null) {
             // Check if Bootstrap is already called
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenCctorAlreadyCallsBootstrap_SkipsPatch; RailManagerInstaller.Tests.TestsPatcher.WhenCctorExistsButEmpty_InsertsCallBeforeRet; RailManagerInstaller.Tests.TestsPatcher.WhenCctorAlreadyCallsDifferentMethod_DoesNotSkipPatch

[Killed] Equality mutation
RailManager/src/RailManagerInstaller/Patcher.cs:82:13
         var bootstrapMethodRef = assemblyCsharp.ImportReference(bootstrapMethod);
 
         var cctor = logManager.Methods.FirstOrDefault(m => m.Name == ".cctor");
-        if (cctor != null) {
+        if (cctor == null) {
             // Check if Bootstrap is already called
             if (cctor.Body.Instructions.Any(o => o.OpCode == OpCodes.Call && o.Operand == bootstrapMethodRef)) {
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenCctorAlreadyCallsBootstrap_SkipsPatch; RailManagerInstaller.Tests.TestsPatcher.WhenCctorExistsButEmpty_InsertsCallBeforeRet; RailManagerInstaller.Tests.TestsPatcher.WhenCctorNotFound_CreatesCctorAndPatches

[Killed] Linq method mutation (Any() to All())
RailManager/src/RailManagerInstaller/Patcher.cs:84:17
         var cctor = logManager.Methods.FirstOrDefault(m => m.Name == ".cctor");
         if (cctor != null) {
             // Check if Bootstrap is already called
-            if (cctor.Body.Instructions.Any(o => o.OpCode == OpCodes.Call && o.Operand == bootstrapMethodRef)) {
+            if (cctor.Body.Instructions.All(o => o.OpCode == OpCodes.Call && o.Operand == bootstrapMethodRef)) {
                 AppServices.Console.WriteLine("Logging.LogManager static constructor already calls ModManager.Bootstrap. Skipping patch.",
                     ConsoleColor.DarkYellow);
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenCctorAlreadyCallsBootstrap_SkipsPatch

[Killed] Equality mutation
RailManager/src/RailManagerInstaller/Patcher.cs:84:78
         var cctor = logManager.Methods.FirstOrDefault(m => m.Name == ".cctor");
         if (cctor != null) {
             // Check if Bootstrap is already called
-            if (cctor.Body.Instructions.Any(o => o.OpCode == OpCodes.Call && o.Operand == bootstrapMethodRef)) {
+            if (cctor.Body.Instructions.Any(o => o.OpCode == OpCodes.Call && o.Operand != bootstrapMethodRef)) {
                 AppServices.Console.WriteLine("Logging.LogManager static constructor already calls ModManager.Bootstrap. Skipping patch.",
                     ConsoleColor.DarkYellow);
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenCctorAlreadyCallsBootstrap_SkipsPatch; RailManagerInstaller.Tests.TestsPatcher.WhenCctorAlreadyCallsDifferentMethod_DoesNotSkipPatch

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Patcher.cs:85:17
         if (cctor != null) {
             // Check if Bootstrap is already called
             if (cctor.Body.Instructions.Any(o => o.OpCode == OpCodes.Call && o.Operand == bootstrapMethodRef)) {
-                AppServices.Console.WriteLine("Logging.LogManager static constructor already calls ModManager.Bootstrap. Skipping patch.",
-                    ConsoleColor.DarkYellow);
+                ;
                 return false;
             }
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenCctorAlreadyCallsBootstrap_SkipsPatch

[Killed] Boolean mutation
RailManager/src/RailManagerInstaller/Patcher.cs:87:24
             if (cctor.Body.Instructions.Any(o => o.OpCode == OpCodes.Call && o.Operand == bootstrapMethodRef)) {
                 AppServices.Console.WriteLine("Logging.LogManager static constructor already calls ModManager.Bootstrap. Skipping patch.",
                     ConsoleColor.DarkYellow);
-                return false;
+                return true;
             }
         } else {
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenCctorAlreadyCallsBootstrap_SkipsPatch

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Patcher.cs:94:13
             const MethodAttributes cctorAttributes = MethodAttributes.Static | MethodAttributes.Private | MethodAttributes.HideBySig |
                                                      MethodAttributes.SpecialName | MethodAttributes.RTSpecialName;
             cctor = new(".cctor", cctorAttributes, assemblyCsharp.TypeSystem.Void);
-            logManager.Methods.Add(cctor);
+            ;
 
             var il = cctor.Body.GetILProcessor();
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenCctorNotFound_CreatesCctorAndPatches

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Patcher.cs:97:13
             logManager.Methods.Add(cctor);
 
             var il = cctor.Body.GetILProcessor();
-            il.Emit(OpCodes.Ret);
+            ;
         }
 
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenCctorNotFound_CreatesCctorAndPatches

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Patcher.cs:106:9
         var callBootstrap = ilProcessor.Create(OpCodes.Call, bootstrapMethodRef);
 
         // Insert Bootstrap call before first instruction
-        ilProcessor.InsertBefore(firstInstruction, callBootstrap);
+        ;
         return true;
     }
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenCctorExistsButEmpty_InsertsCallBeforeRet; RailManagerInstaller.Tests.TestsPatcher.WhenCctorNotFound_CreatesCctorAndPatches; RailManagerInstaller.Tests.TestsPatcher.WhenCctorAlreadyCallsDifferentMethod_DoesNotSkipPatch

[Killed] Boolean mutation
RailManager/src/RailManagerInstaller/Patcher.cs:107:16
 
         // Insert Bootstrap call before first instruction
         ilProcessor.InsertBefore(firstInstruction, callBootstrap);
-        return true;
+        return false;
     }
 
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenCctorExistsButEmpty_InsertsCallBeforeRet; RailManagerInstaller.Tests.TestsPatcher.WhenCctorNotFound_CreatesCctorAndPatches; RailManagerInstaller.Tests.TestsPatcher.WhenCctorAlreadyCallsDifferentMethod_DoesNotSkipPatch

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Patcher.cs:113:9
     private static IModuleDefinition InjectModule(IModuleDefinition assemblyCsharpModule, string name, string path, ReaderParameters readerParameters) {
         var modInterfacesModule = AppServices.ModuleDefinition.ReadModule(path, readerParameters);
         var modInterfacesReference = new AssemblyNameReference(name, modInterfacesModule.Assembly.Name.Version);
-        assemblyCsharpModule.AssemblyReferences.Add(modInterfacesReference);
+        ;
         return modInterfacesModule;
     }
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenInjectModManagerInterfacesSucceeds_AddsAssemblyReference; RailManagerInstaller.Tests.TestsPatcher.WhenInjectModManagerSucceeds_AddsAssemblyReference

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
RailManager/src/RailManagerInstaller/Patcher.cs:119:13
 
     private static string GetFile(string path, string name) {
         var filePath = Path.Combine(path, name);
-        if (!AppServices.File.Exists(filePath)) {
+        if (AppServices.File.Exists(filePath)) {
             throw new InstallerException($"Could not locate file '{name}'.");
         }
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenBootstrapMethodMissing_ThrowsInstallerException; RailManagerInstaller.Tests.TestsPatcher.WhenImportReferenceThrows_ThrowsInstallerException; RailManagerInstaller.Tests.TestsPatcher.WhenAlreadyPatched_WritesAlreadyPatchedMessageAndExits

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Patcher.cs:120:13
     private static string GetFile(string path, string name) {
         var filePath = Path.Combine(path, name);
         if (!AppServices.File.Exists(filePath)) {
-            throw new InstallerException($"Could not locate file '{name}'.");
+            ;
         }
 
killedBy: RailManagerInstaller.Tests.TestsPatcher.WhenModManagerInterfacesDllNotFound_ThrowsInstallerException; RailManagerInstaller.Tests.TestsPatcher.WhenAssemblyCsharpDllNotFound_ThrowsInstallerException; RailManagerInstaller.Tests.TestsPatcher.WhenModManagerDllNotFound_ThrowsInstallerException
