[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Program.cs:17:13
     
     public static void Main() {
         try {
-            RunInstaller();
+            ;
         } catch (InstallerException ex) {
             AppServices.Console.WriteLine(ex.Message!, ConsoleColor.Red);
killedBy: RailManagerInstaller.Tests.TestsProgram.MainReports_GamePathException; RailManagerInstaller.Tests.TestsProgram.MainReports_Success; RailManagerInstaller.Tests.TestsProgram.MainReports_InstallerException_WithInnerException

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Program.cs:19:13
         try {
             RunInstaller();
         } catch (InstallerException ex) {
-            AppServices.Console.WriteLine(ex.Message!, ConsoleColor.Red);
+            ;
             if (ex.InnerException != null) {
                 AppServices.Console.WriteLine(" - " + ex.InnerException.Message!, ConsoleColor.Red);
killedBy: RailManagerInstaller.Tests.TestsProgram.MainReports_InstallerException_WithInnerException; RailManagerInstaller.Tests.TestsProgram.MainReports_InstallerException

[Killed] Equality mutation
RailManager/src/RailManagerInstaller/Program.cs:20:17
             RunInstaller();
         } catch (InstallerException ex) {
             AppServices.Console.WriteLine(ex.Message!, ConsoleColor.Red);
-            if (ex.InnerException != null) {
+            if (ex.InnerException == null) {
                 AppServices.Console.WriteLine(" - " + ex.InnerException.Message!, ConsoleColor.Red);
             }
killedBy: RailManagerInstaller.Tests.TestsProgram.MainReports_InstallerException_WithInnerException; RailManagerInstaller.Tests.TestsProgram.MainReports_InstallerException

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Program.cs:21:17
         } catch (InstallerException ex) {
             AppServices.Console.WriteLine(ex.Message!, ConsoleColor.Red);
             if (ex.InnerException != null) {
-                AppServices.Console.WriteLine(" - " + ex.InnerException.Message!, ConsoleColor.Red);
+                ;
             }
         } catch (GamePathException ex) {
killedBy: RailManagerInstaller.Tests.TestsProgram.MainReports_InstallerException_WithInnerException

[Killed] String mutation
RailManager/src/RailManagerInstaller/Program.cs:21:47
         } catch (InstallerException ex) {
             AppServices.Console.WriteLine(ex.Message!, ConsoleColor.Red);
             if (ex.InnerException != null) {
-                AppServices.Console.WriteLine(" - " + ex.InnerException.Message!, ConsoleColor.Red);
+                AppServices.Console.WriteLine("" + ex.InnerException.Message!, ConsoleColor.Red);
             }
         } catch (GamePathException ex) {
killedBy: RailManagerInstaller.Tests.TestsProgram.MainReports_InstallerException_WithInnerException

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Program.cs:24:13
                 AppServices.Console.WriteLine(" - " + ex.InnerException.Message!, ConsoleColor.Red);
             }
         } catch (GamePathException ex) {
-            AppServices.Console.WriteLine(ex.Message!, ConsoleColor.Red);
+            ;
             AppServices.Console.WriteLine("Could not determine Railroader directory automatically.", ConsoleColor.Red);
             AppServices.Console.WriteLine("Move this installer into your game's directory, then run again.");
killedBy: RailManagerInstaller.Tests.TestsProgram.MainReports_GamePathException

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Program.cs:25:13
             }
         } catch (GamePathException ex) {
             AppServices.Console.WriteLine(ex.Message!, ConsoleColor.Red);
-            AppServices.Console.WriteLine("Could not determine Railroader directory automatically.", ConsoleColor.Red);
+            ;
             AppServices.Console.WriteLine("Move this installer into your game's directory, then run again.");
         } catch (Exception ex) {
killedBy: RailManagerInstaller.Tests.TestsProgram.MainReports_GamePathException

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Program.cs:26:13
         } catch (GamePathException ex) {
             AppServices.Console.WriteLine(ex.Message!, ConsoleColor.Red);
             AppServices.Console.WriteLine("Could not determine Railroader directory automatically.", ConsoleColor.Red);
-            AppServices.Console.WriteLine("Move this installer into your game's directory, then run again.");
+            ;
         } catch (Exception ex) {
             AppServices.Console.WriteLine("Unexpected error:", ConsoleColor.Red);
killedBy: RailManagerInstaller.Tests.TestsProgram.MainReports_GamePathException

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Program.cs:28:13
             AppServices.Console.WriteLine("Could not determine Railroader directory automatically.", ConsoleColor.Red);
             AppServices.Console.WriteLine("Move this installer into your game's directory, then run again.");
         } catch (Exception ex) {
-            AppServices.Console.WriteLine("Unexpected error:", ConsoleColor.Red);
+            ;
             AppServices.Console.WriteLine(ex.ToString(), ConsoleColor.Red);
         } finally {
killedBy: RailManagerInstaller.Tests.TestsProgram.MainReports_GenericsException

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Program.cs:29:13
             AppServices.Console.WriteLine("Move this installer into your game's directory, then run again.");
         } catch (Exception ex) {
             AppServices.Console.WriteLine("Unexpected error:", ConsoleColor.Red);
-            AppServices.Console.WriteLine(ex.ToString(), ConsoleColor.Red);
+            ;
         } finally {
             AppServices.Console.WriteLine("Press any key to exit.", ConsoleColor.White);
killedBy: RailManagerInstaller.Tests.TestsProgram.MainReports_GenericsException

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Program.cs:31:13
             AppServices.Console.WriteLine("Unexpected error:", ConsoleColor.Red);
             AppServices.Console.WriteLine(ex.ToString(), ConsoleColor.Red);
         } finally {
-            AppServices.Console.WriteLine("Press any key to exit.", ConsoleColor.White);
+            ;
             AppServices.Console.ReadKey();
         }
killedBy: RailManagerInstaller.Tests.TestsProgram.MainReports_GamePathException; RailManagerInstaller.Tests.TestsProgram.MainReports_Success; RailManagerInstaller.Tests.TestsProgram.MainReports_InstallerException_WithInnerException

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Program.cs:32:13
             AppServices.Console.WriteLine(ex.ToString(), ConsoleColor.Red);
         } finally {
             AppServices.Console.WriteLine("Press any key to exit.", ConsoleColor.White);
-            AppServices.Console.ReadKey();
+            ;
         }
     }
killedBy: RailManagerInstaller.Tests.TestsProgram.MainReports_GamePathException; RailManagerInstaller.Tests.TestsProgram.MainReports_Success; RailManagerInstaller.Tests.TestsProgram.MainReports_InstallerException_WithInnerException

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Program.cs:42:13
         try {
             _ExecutingAssembly = AppServices.Assembly.GetExecutingAssembly();
             var assemblyName = _ExecutingAssembly.GetName().Name;
-            AppServices.Console.Write(assemblyName + " ");
+            ;
             AppServices.Console.WriteLine(_ExecutingAssembly.GetName().Version, ConsoleColor.DarkGreen);
             AppServices.Console.SetTitle($"{assemblyName} {_ExecutingAssembly.GetName().Version}");
killedBy: RailManagerInstaller.Tests.TestsProgram.ReportInstallerVersion_AndSetConsoleTitle; RailManagerInstaller.Tests.TestsProgram.MainReports_Success; RailManagerInstaller.Tests.TestsProgram.RunInstaller_SuccessfulInstallation_CompletesAllSteps

[Killed] String mutation
RailManager/src/RailManagerInstaller/Program.cs:42:54
         try {
             _ExecutingAssembly = AppServices.Assembly.GetExecutingAssembly();
             var assemblyName = _ExecutingAssembly.GetName().Name;
-            AppServices.Console.Write(assemblyName + " ");
+            AppServices.Console.Write(assemblyName + "");
             AppServices.Console.WriteLine(_ExecutingAssembly.GetName().Version, ConsoleColor.DarkGreen);
             AppServices.Console.SetTitle($"{assemblyName} {_ExecutingAssembly.GetName().Version}");
killedBy: RailManagerInstaller.Tests.TestsProgram.ReportInstallerVersion_AndSetConsoleTitle; RailManagerInstaller.Tests.TestsProgram.MainReports_Success; RailManagerInstaller.Tests.TestsProgram.RunInstaller_SuccessfulInstallation_CompletesAllSteps

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Program.cs:43:13
             _ExecutingAssembly = AppServices.Assembly.GetExecutingAssembly();
             var assemblyName = _ExecutingAssembly.GetName().Name;
             AppServices.Console.Write(assemblyName + " ");
-            AppServices.Console.WriteLine(_ExecutingAssembly.GetName().Version, ConsoleColor.DarkGreen);
+            ;
             AppServices.Console.SetTitle($"{assemblyName} {_ExecutingAssembly.GetName().Version}");
         } catch (PlatformNotSupportedException) {
killedBy: RailManagerInstaller.Tests.TestsProgram.ReportInstallerVersion_AndSetConsoleTitle; RailManagerInstaller.Tests.TestsProgram.MainReports_Success; RailManagerInstaller.Tests.TestsProgram.RunInstaller_SuccessfulInstallation_CompletesAllSteps

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Program.cs:44:13
             var assemblyName = _ExecutingAssembly.GetName().Name;
             AppServices.Console.Write(assemblyName + " ");
             AppServices.Console.WriteLine(_ExecutingAssembly.GetName().Version, ConsoleColor.DarkGreen);
-            AppServices.Console.SetTitle($"{assemblyName} {_ExecutingAssembly.GetName().Version}");
+            ;
         } catch (PlatformNotSupportedException) {
         }
killedBy: RailManagerInstaller.Tests.TestsProgram.ReportInstallerVersion_AndSetConsoleTitle; RailManagerInstaller.Tests.TestsProgram.MainReports_Success; RailManagerInstaller.Tests.TestsProgram.RunInstaller_SuccessfulInstallation_CompletesAllSteps

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Program.cs:51:9
         // stryker disable once assignment
         AppDomain.CurrentDomain.AssemblyResolve += ResolveInternalAssembliesHandler;
 
-        ResolveGameDirectory();
+        ;
         ResourceExtractor.ExtractFiles(_ExecutingAssembly);
         Patcher.PatchGame();
killedBy: RailManagerInstaller.Tests.TestsProgram.MainReports_Success; RailManagerInstaller.Tests.TestsProgram.RunInstaller_SuccessfulInstallation_CompletesAllSteps; RailManagerInstaller.Tests.TestsProgram.ResolveGameDirectory_ResolverReturnsNull_ThrowsGamePathException

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Program.cs:52:9
         AppDomain.CurrentDomain.AssemblyResolve += ResolveInternalAssembliesHandler;
 
         ResolveGameDirectory();
-        ResourceExtractor.ExtractFiles(_ExecutingAssembly);
+        ;
         Patcher.PatchGame();
         AppServices.Directory.CreateDirectory("Mods");
killedBy: RailManagerInstaller.Tests.TestsProgram.MainReports_Success; RailManagerInstaller.Tests.TestsProgram.RunInstaller_SuccessfulInstallation_CompletesAllSteps; RailManagerInstaller.Tests.TestsProgram.ResolveGameDirectory_ResolverReturnsExistingPath_SetCurrentDirectory

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Program.cs:53:9
 
         ResolveGameDirectory();
         ResourceExtractor.ExtractFiles(_ExecutingAssembly);
-        Patcher.PatchGame();
+        ;
         AppServices.Directory.CreateDirectory("Mods");
 
killedBy: RailManagerInstaller.Tests.TestsProgram.MainReports_Success; RailManagerInstaller.Tests.TestsProgram.RunInstaller_SuccessfulInstallation_CompletesAllSteps

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Program.cs:54:9
         ResolveGameDirectory();
         ResourceExtractor.ExtractFiles(_ExecutingAssembly);
         Patcher.PatchGame();
-        AppServices.Directory.CreateDirectory("Mods");
+        ;
 
         AppServices.Console.WriteLine("Installation complete!", ConsoleColor.DarkGreen);
killedBy: RailManagerInstaller.Tests.TestsProgram.MainReports_Success; RailManagerInstaller.Tests.TestsProgram.RunInstaller_SuccessfulInstallation_CompletesAllSteps

[Killed] String mutation
RailManager/src/RailManagerInstaller/Program.cs:54:47
         ResolveGameDirectory();
         ResourceExtractor.ExtractFiles(_ExecutingAssembly);
         Patcher.PatchGame();
-        AppServices.Directory.CreateDirectory("Mods");
+        AppServices.Directory.CreateDirectory("");
 
         AppServices.Console.WriteLine("Installation complete!", ConsoleColor.DarkGreen);
killedBy: RailManagerInstaller.Tests.TestsProgram.MainReports_Success; RailManagerInstaller.Tests.TestsProgram.RunInstaller_SuccessfulInstallation_CompletesAllSteps

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Program.cs:56:9
         Patcher.PatchGame();
         AppServices.Directory.CreateDirectory("Mods");
 
-        AppServices.Console.WriteLine("Installation complete!", ConsoleColor.DarkGreen);
+        ;
     }
 
killedBy: RailManagerInstaller.Tests.TestsProgram.MainReports_Success; RailManagerInstaller.Tests.TestsProgram.RunInstaller_SuccessfulInstallation_CompletesAllSteps

[Killed] String mutation
RailManager/src/RailManagerInstaller/Program.cs:56:39
         Patcher.PatchGame();
         AppServices.Directory.CreateDirectory("Mods");
 
-        AppServices.Console.WriteLine("Installation complete!", ConsoleColor.DarkGreen);
+        AppServices.Console.WriteLine("", ConsoleColor.DarkGreen);
     }
 
killedBy: RailManagerInstaller.Tests.TestsProgram.MainReports_Success; RailManagerInstaller.Tests.TestsProgram.RunInstaller_SuccessfulInstallation_CompletesAllSteps

[Killed] Equality mutation
RailManager/src/RailManagerInstaller/Program.cs:61:13
 
     private static void ResolveGameDirectory() {
         var path = GameDirectoryResolver.TryResolveGameDirectory(_ExecutingAssembly);
-        if (path == null) {
+        if (path != null) {
             throw new GamePathException($"Could not find {Railroader} using Steam's Library.");
         }
killedBy: RailManagerInstaller.Tests.TestsProgram.MainReports_Success; RailManagerInstaller.Tests.TestsProgram.RunInstaller_SuccessfulInstallation_CompletesAllSteps; RailManagerInstaller.Tests.TestsProgram.ResolveGameDirectory_ResolverReturnsNull_ThrowsGamePathException

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Program.cs:62:13
     private static void ResolveGameDirectory() {
         var path = GameDirectoryResolver.TryResolveGameDirectory(_ExecutingAssembly);
         if (path == null) {
-            throw new GamePathException($"Could not find {Railroader} using Steam's Library.");
+            ;
         }
 
killedBy: RailManagerInstaller.Tests.TestsProgram.ResolveGameDirectory_ResolverReturnsNull_ThrowsGamePathException

[Killed] Negate expression
RailManager/src/RailManagerInstaller/Program.cs:65:13
             throw new GamePathException($"Could not find {Railroader} using Steam's Library.");
         }
 
-        if (AppServices.File.Exists(Path.Combine(path, Railroader))) {
+        if (!(AppServices.File.Exists(Path.Combine(path, Railroader)))) {
             AppServices.Console.WriteLine("Found Railroader using Steam's Library.");
             AppServices.Directory.SetCurrentDirectory(path);
killedBy: RailManagerInstaller.Tests.TestsProgram.MainReports_Success; RailManagerInstaller.Tests.TestsProgram.RunInstaller_SuccessfulInstallation_CompletesAllSteps; RailManagerInstaller.Tests.TestsProgram.ResolveGameDirectory_ResolverReturnsNonExistingPath_ThrowsGamePathException

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Program.cs:66:13
         }
 
         if (AppServices.File.Exists(Path.Combine(path, Railroader))) {
-            AppServices.Console.WriteLine("Found Railroader using Steam's Library.");
+            ;
             AppServices.Directory.SetCurrentDirectory(path);
             return;
killedBy: RailManagerInstaller.Tests.TestsProgram.MainReports_Success; RailManagerInstaller.Tests.TestsProgram.RunInstaller_SuccessfulInstallation_CompletesAllSteps; RailManagerInstaller.Tests.TestsProgram.ResolveGameDirectory_ResolverReturnsExistingPath_SetCurrentDirectory

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Program.cs:67:13
 
         if (AppServices.File.Exists(Path.Combine(path, Railroader))) {
             AppServices.Console.WriteLine("Found Railroader using Steam's Library.");
-            AppServices.Directory.SetCurrentDirectory(path);
+            ;
             return;
         }
killedBy: RailManagerInstaller.Tests.TestsProgram.MainReports_Success; RailManagerInstaller.Tests.TestsProgram.RunInstaller_SuccessfulInstallation_CompletesAllSteps; RailManagerInstaller.Tests.TestsProgram.ResolveGameDirectory_ResolverReturnsExistingPath_SetCurrentDirectory

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Program.cs:68:13
         if (AppServices.File.Exists(Path.Combine(path, Railroader))) {
             AppServices.Console.WriteLine("Found Railroader using Steam's Library.");
             AppServices.Directory.SetCurrentDirectory(path);
-            return;
+            ;
         }
 
killedBy: RailManagerInstaller.Tests.TestsProgram.MainReports_Success; RailManagerInstaller.Tests.TestsProgram.RunInstaller_SuccessfulInstallation_CompletesAllSteps; RailManagerInstaller.Tests.TestsProgram.ResolveGameDirectory_ResolverReturnsExistingPath_SetCurrentDirectory

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Program.cs:71:9
             return;
         }
 
-        throw new GamePathException($"Could not find {Railroader} (Steam's Library path is invalid).");
+        ;
     }
 
killedBy: RailManagerInstaller.Tests.TestsProgram.ResolveGameDirectory_ResolverReturnsNonExistingPath_ThrowsGamePathException

[Killed] String mutation
RailManager/src/RailManagerInstaller/Program.cs:71:37
             return;
         }
 
-        throw new GamePathException($"Could not find {Railroader} (Steam's Library path is invalid).");
+        throw new GamePathException($"");
     }
 
killedBy: RailManagerInstaller.Tests.TestsProgram.ResolveGameDirectory_ResolverReturnsNonExistingPath_ThrowsGamePathException

[Killed] Negate expression
RailManager/src/RailManagerInstaller/Program.cs:79:13
 
     public static IAssembly ResolveInternalAssemblies(object sender, ResolveEventArgs args) {
         var name = new AssemblyName(args.Name!).Name;
-        if (!name.StartsWith("Mono.Cecil") && !name.StartsWith("Newtonsoft.Json")) {
+        if (!(!name.StartsWith("Mono.Cecil") && !name.StartsWith("Newtonsoft.Json"))) {
             throw new InstallerException($"Could not load missing assembly: {name}");
         }
killedBy: RailManagerInstaller.Tests.TestsProgram.ResolveInternalAssemblies_Embedded; RailManagerInstaller.Tests.TestsProgram.ResolveInternalAssemblies_NotEmbedded; RailManagerInstaller.Tests.TestsProgram.ResolveInternalAssemblies_UnknownName

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
RailManager/src/RailManagerInstaller/Program.cs:79:13
 
     public static IAssembly ResolveInternalAssemblies(object sender, ResolveEventArgs args) {
         var name = new AssemblyName(args.Name!).Name;
-        if (!name.StartsWith("Mono.Cecil") && !name.StartsWith("Newtonsoft.Json")) {
+        if (name.StartsWith("Mono.Cecil") && !name.StartsWith("Newtonsoft.Json")) {
             throw new InstallerException($"Could not load missing assembly: {name}");
         }
killedBy: RailManagerInstaller.Tests.TestsProgram.ResolveInternalAssemblies_Embedded; RailManagerInstaller.Tests.TestsProgram.ResolveInternalAssemblies_NotEmbedded; RailManagerInstaller.Tests.TestsProgram.ResolveInternalAssemblies_UnknownName

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/Program.cs:80:13
     public static IAssembly ResolveInternalAssemblies(object sender, ResolveEventArgs args) {
         var name = new AssemblyName(args.Name!).Name;
         if (!name.StartsWith("Mono.Cecil") && !name.StartsWith("Newtonsoft.Json")) {
-            throw new InstallerException($"Could not load missing assembly: {name}");
+            ;
         }
 
killedBy: RailManagerInstaller.Tests.TestsProgram.ResolveInternalAssemblies_UnknownName

[Killed] String mutation
RailManager/src/RailManagerInstaller/Program.cs:85:54
 
         var executingAssembly = AppServices.Assembly.GetExecutingAssembly();
         var stream = executingAssembly.GetManifestResourceStream($"Assemblies/{name}.dll")
-                     ?? throw new InstallerException($"Embedded assembly not found: {name}.dll");
+                     ?? throw new InstallerException($"");
 
         var buffer = new byte[stream.Length];
killedBy: RailManagerInstaller.Tests.TestsProgram.ResolveInternalAssemblies_NotEmbedded
