[Killed] String mutation
RailManager/src/RailManagerInstaller/ResourceExtractor.cs:14:73
     public static Action<IAssembly> ExtractFiles = ExtractFilesCore;
     
     public static void ExtractFilesCore(IAssembly executingAssembly) {
-        var prefix = typeof(Program).FullName!.Replace(nameof(Program), "Assemblies");
+        var prefix = typeof(Program).FullName!.Replace(nameof(Program), "");
 
         string[] assemblies = [
killedBy: RailManagerInstaller.Tests.TestResourceExtractor.ExtractAssembly

[Killed] String mutation
RailManager/src/RailManagerInstaller/ResourceExtractor.cs:17:13
         var prefix = typeof(Program).FullName!.Replace(nameof(Program), "Assemblies");
 
         string[] assemblies = [
-            "0Harmony.dll",
+            "",
             "Mono.Cecil.dll",
             "Mono.CSharp.dll",
killedBy: RailManagerInstaller.Tests.TestResourceExtractor.ExtractAssembly

[Killed] String mutation
RailManager/src/RailManagerInstaller/ResourceExtractor.cs:18:13
 
         string[] assemblies = [
             "0Harmony.dll",
-            "Mono.Cecil.dll",
+            "",
             "Mono.CSharp.dll",
             "RailManager.dll",
killedBy: RailManagerInstaller.Tests.TestResourceExtractor.ExtractAssembly

[Killed] String mutation
RailManager/src/RailManagerInstaller/ResourceExtractor.cs:20:13
             "0Harmony.dll",
             "Mono.Cecil.dll",
             "Mono.CSharp.dll",
-            "RailManager.dll",
+            "",
             "RailManager.Interfaces.dll"
         ];
killedBy: RailManagerInstaller.Tests.TestResourceExtractor.ExtractAssembly

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/ResourceExtractor.cs:24:9
             "RailManager.Interfaces.dll"
         ];
 
-        AppServices.Console.WriteLine("Extracting files ...");
+        ;
         foreach (var assembly in assemblies) {
             var path = Path.Combine(AppServices.Directory.GetCurrentDirectory(), "Railroader_Data", "Managed", assembly);
killedBy: RailManagerInstaller.Tests.TestResourceExtractor.ExtractAssembly

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/ResourceExtractor.cs:28:13
         foreach (var assembly in assemblies) {
             var path = Path.Combine(AppServices.Directory.GetCurrentDirectory(), "Railroader_Data", "Managed", assembly);
 
-            AppServices.Console.WriteLine(path, ConsoleColor.DarkCyan);
+            ;
 
             using var stream = executingAssembly.GetManifestResourceStream($"{prefix}.{assembly}")!;
killedBy: RailManagerInstaller.Tests.TestResourceExtractor.ExtractAssembly

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/ResourceExtractor.cs:33:13
             using var stream = executingAssembly.GetManifestResourceStream($"{prefix}.{assembly}")!;
 
             using var fileStream = AppServices.File.Open(path, FileMode.OpenOrCreate, FileAccess.Write);
-            stream.CopyTo(fileStream);
+            ;
         }
     }
killedBy: RailManagerInstaller.Tests.TestResourceExtractor.ExtractAssembly
