[Killed] Block removal mutation
RailManager/src/RailManagerInstaller/VdfEntry.cs:19:55
 {
     public static VdfEntryLoader Load = LoadEntry;
 
-    public static VdfEntry LoadEntry(string fullPath) {
-        var lines = AppServices.File.ReadAllLines(fullPath);
-        return Parse(lines);
-    }
+    public static VdfEntry LoadEntry(string fullPath) {}
 
     public T? FindValue<T>(string name) {
killedBy: RailManagerInstaller.Tests.TestsVdfEntry.Load

[Killed] Block removal mutation
RailManager/src/RailManagerInstaller/VdfEntry.cs:24:41
         return Parse(lines);
     }
 
-    public T? FindValue<T>(string name) {
-        TryGetValue(name, out var value);
-        return value is T o ? o : default;
-    }
+    public T? FindValue<T>(string name) {}
 
     public static VdfEntry Parse(string[] lines) {
killedBy: RailManagerInstaller.Tests.TestGameDirectoryResolver.ResolveGameDirectory_ReturnsPathFromVdf; RailManagerInstaller.Tests.TestGameDirectoryResolver.ResolveGameDirectory_InvalidVdf_NoPathInApps; RailManagerInstaller.Tests.TestGameDirectoryResolver.TryResolveGameDirectory_SteamPath

[Killed] Block removal mutation
RailManager/src/RailManagerInstaller/VdfEntry.cs:29:50
         return value is T o ? o : default;
     }
 
-    public static VdfEntry Parse(string[] lines) {
-        var i = 0;
-        return Parse(lines, 0, ref i);
-    }
+    public static VdfEntry Parse(string[] lines) {}
 
     private static VdfEntry Parse(string[] lines, int level, ref int i) {
killedBy: RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedEmptyValue; RailManagerInstaller.Tests.TestsVdfEntry.Malformed_NoOpeningBrace; RailManagerInstaller.Tests.TestsVdfEntry.ComplexEmptyValue

[Killed] Equality mutation
RailManager/src/RailManagerInstaller/VdfEntry.cs:36:16
 
     private static VdfEntry Parse(string[] lines, int level, ref int i) {
         var entry = new VdfEntry();
-        for (; i < lines.Length; i++) {
+        for (; i <= lines.Length; i++) {
             var line = lines[i].Trim();
             if (line == "}") {
killedBy: RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedEmptyValue; RailManagerInstaller.Tests.TestsVdfEntry.ComplexEmptyValue; RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedValue

[Killed] Equality mutation
RailManager/src/RailManagerInstaller/VdfEntry.cs:36:16
 
     private static VdfEntry Parse(string[] lines, int level, ref int i) {
         var entry = new VdfEntry();
-        for (; i < lines.Length; i++) {
+        for (; i > lines.Length; i++) {
             var line = lines[i].Trim();
             if (line == "}") {
killedBy: RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedEmptyValue; RailManagerInstaller.Tests.TestsVdfEntry.Malformed_NoOpeningBrace; RailManagerInstaller.Tests.TestsVdfEntry.ComplexEmptyValue

[Killed] Equality mutation
RailManager/src/RailManagerInstaller/VdfEntry.cs:38:17
         var entry = new VdfEntry();
         for (; i < lines.Length; i++) {
             var line = lines[i].Trim();
-            if (line == "}") {
+            if (line != "}") {
                 break;
             }
killedBy: RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedEmptyValue; RailManagerInstaller.Tests.TestsVdfEntry.Malformed_NoOpeningBrace; RailManagerInstaller.Tests.TestsVdfEntry.ComplexEmptyValue

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/VdfEntry.cs:39:17
         for (; i < lines.Length; i++) {
             var line = lines[i].Trim();
             if (line == "}") {
-                break;
+                ;
             }
 
killedBy: RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedEmptyValue; RailManagerInstaller.Tests.TestsVdfEntry.ComplexEmptyValue; RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedValue

[Killed] Negate expression
RailManager/src/RailManagerInstaller/VdfEntry.cs:42:17
                 break;
             }
 
-            if (IsSimpleValue(line, out var key, out var value)) {
+            if (!(IsSimpleValue(line, out var key, out var value))) {
                 entry.Add(key, value);
                 continue;
killedBy: RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedEmptyValue; RailManagerInstaller.Tests.TestsVdfEntry.Malformed_NoOpeningBrace; RailManagerInstaller.Tests.TestsVdfEntry.ComplexEmptyValue

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/VdfEntry.cs:43:17
             }
 
             if (IsSimpleValue(line, out var key, out var value)) {
-                entry.Add(key, value);
+                ;
                 continue;
             }
killedBy: RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedValue; RailManagerInstaller.Tests.TestsVdfEntry.SimpleValue

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/VdfEntry.cs:44:17
 
             if (IsSimpleValue(line, out var key, out var value)) {
                 entry.Add(key, value);
-                continue;
+                ;
             }
 
killedBy: RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedValue; RailManagerInstaller.Tests.TestsVdfEntry.SimpleValue; RailManagerInstaller.Tests.TestsVdfEntry.Malformed_MissingClosingBrace

[Killed] Negate expression
RailManager/src/RailManagerInstaller/VdfEntry.cs:47:17
                 continue;
             }
 
-            if (IsKey(line, out key)) {
+            if (!(IsKey(line, out key))) {
                 i++;
                 if (lines[i].Trim() != "{") {
killedBy: RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedEmptyValue; RailManagerInstaller.Tests.TestsVdfEntry.Malformed_NoOpeningBrace; RailManagerInstaller.Tests.TestsVdfEntry.ComplexEmptyValue

[Killed] PostIncrementExpression to PostDecrementExpression mutation
RailManager/src/RailManagerInstaller/VdfEntry.cs:48:17
             }
 
             if (IsKey(line, out key)) {
-                i++;
+                i--;
                 if (lines[i].Trim() != "{") {
                     throw new VdfException("Expected '{' after key");
killedBy: RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedEmptyValue; RailManagerInstaller.Tests.TestsVdfEntry.Malformed_NoOpeningBrace; RailManagerInstaller.Tests.TestsVdfEntry.ComplexEmptyValue

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/VdfEntry.cs:48:17
             }
 
             if (IsKey(line, out key)) {
-                i++;
+                ;
                 if (lines[i].Trim() != "{") {
                     throw new VdfException("Expected '{' after key");
killedBy: RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedEmptyValue; RailManagerInstaller.Tests.TestsVdfEntry.ComplexEmptyValue; RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedValue

[Killed] Equality mutation
RailManager/src/RailManagerInstaller/VdfEntry.cs:49:21
 
             if (IsKey(line, out key)) {
                 i++;
-                if (lines[i].Trim() != "{") {
+                if (lines[i].Trim() == "{") {
                     throw new VdfException("Expected '{' after key");
                 }
killedBy: RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedEmptyValue; RailManagerInstaller.Tests.TestsVdfEntry.Malformed_NoOpeningBrace; RailManagerInstaller.Tests.TestsVdfEntry.ComplexEmptyValue

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/VdfEntry.cs:50:21
             if (IsKey(line, out key)) {
                 i++;
                 if (lines[i].Trim() != "{") {
-                    throw new VdfException("Expected '{' after key");
+                    ;
                 }
 
killedBy: RailManagerInstaller.Tests.TestsVdfEntry.Malformed_NoOpeningBrace

[Killed] Arithmetic mutation
RailManager/src/RailManagerInstaller/VdfEntry.cs:54:43
                 }
 
                 i++;
-                var nested = Parse(lines, level + 1, ref i);
+                var nested = Parse(lines, level - 1, ref i);
                 entry.Add(key, nested);
                 continue;
killedBy: RailManagerInstaller.Tests.TestsVdfEntry.Malformed_MissingClosingBrace

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/VdfEntry.cs:55:17
 
                 i++;
                 var nested = Parse(lines, level + 1, ref i);
-                entry.Add(key, nested);
+                ;
                 continue;
             }
killedBy: RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedEmptyValue; RailManagerInstaller.Tests.TestsVdfEntry.ComplexEmptyValue; RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedValue

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/VdfEntry.cs:56:17
                 i++;
                 var nested = Parse(lines, level + 1, ref i);
                 entry.Add(key, nested);
-                continue;
+                ;
             }
 
killedBy: RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedEmptyValue; RailManagerInstaller.Tests.TestsVdfEntry.ComplexEmptyValue; RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedValue

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/VdfEntry.cs:59:13
                 continue;
             }
 
-            throw new VdfException("Unexpected line in vdf file");
+            ;
         }
 
killedBy: RailManagerInstaller.Tests.TestsVdfEntry.Malformed_UnknownLine

[Killed] Negate expression
RailManager/src/RailManagerInstaller/VdfEntry.cs:62:13
             throw new VdfException("Unexpected line in vdf file");
         }
 
-        if (i == lines.Length && level > 0) {
+        if (!(i == lines.Length && level > 0)) {
             throw new VdfException("Unexpected end of vdf file");
         }
killedBy: RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedEmptyValue; RailManagerInstaller.Tests.TestsVdfEntry.ComplexEmptyValue; RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedValue

[Killed] Equality mutation
RailManager/src/RailManagerInstaller/VdfEntry.cs:62:34
             throw new VdfException("Unexpected line in vdf file");
         }
 
-        if (i == lines.Length && level > 0) {
+        if (i == lines.Length && level >= 0) {
             throw new VdfException("Unexpected end of vdf file");
         }
killedBy: RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedEmptyValue; RailManagerInstaller.Tests.TestsVdfEntry.ComplexEmptyValue; RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedValue

[Killed] Statement mutation
RailManager/src/RailManagerInstaller/VdfEntry.cs:63:13
         }
 
         if (i == lines.Length && level > 0) {
-            throw new VdfException("Unexpected end of vdf file");
+            ;
         }
 
killedBy: RailManagerInstaller.Tests.TestsVdfEntry.Malformed_MissingClosingBrace

[Killed] Negate expression
RailManager/src/RailManagerInstaller/VdfEntry.cs:76:13
         value = null;
 
         var match = _SimpleValue.Match(line);
-        if (match.Success) {
+        if (!(match.Success)) {
             key = match.Groups["key"]!.Value;
             value = match.Groups["value"]!.Value;
killedBy: RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedValue; RailManagerInstaller.Tests.TestsVdfEntry.SimpleValue; RailManagerInstaller.Tests.TestsVdfEntry.Malformed_MissingClosingBrace

[Killed] String mutation
RailManager/src/RailManagerInstaller/VdfEntry.cs:77:32
 
         var match = _SimpleValue.Match(line);
         if (match.Success) {
-            key = match.Groups["key"]!.Value;
+            key = match.Groups[""]!.Value;
             value = match.Groups["value"]!.Value;
         }
killedBy: RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedValue; RailManagerInstaller.Tests.TestsVdfEntry.SimpleValue; RailManagerInstaller.Tests.TestsVdfEntry.ManySimpleValues

[Killed] String mutation
RailManager/src/RailManagerInstaller/VdfEntry.cs:84:46
         return match.Success;
     }
 
-    private static readonly Regex _Key = new(@"^\s*""(?<key>[^""]+)""\s*$", RegexOptions.Compiled);
+    private static readonly Regex _Key = new("", RegexOptions.Compiled);
 
     private static bool IsKey(string line, [NotNullWhen(true)] out string? key) {
killedBy: RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedEmptyValue; RailManagerInstaller.Tests.TestsVdfEntry.ComplexEmptyValue; RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedValue

[Killed] Negate expression
RailManager/src/RailManagerInstaller/VdfEntry.cs:90:13
         key = null;
 
         var match = _Key.Match(line);
-        if (match.Success) {
+        if (!(match.Success)) {
             key = match.Groups["key"]!.Value;
         }
killedBy: RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedEmptyValue; RailManagerInstaller.Tests.TestsVdfEntry.ComplexEmptyValue; RailManagerInstaller.Tests.TestsVdfEntry.ComplexNestedValue
