[Killed] Block removal mutation
RailManager/src/MockFileSystem/BaseFileSystem.cs:21:32
 {
     private readonly EntryDictionary _Entries = new();
 
-    protected BaseFileSystem() {
-        Directory = new MemoryDirectoryStatic(this).Mock();
-        File = new MemoryFileStatic(this).Mock();
-        ZipFile = new MemoryZipFileStatic(this).Mock();
-    }
+    protected BaseFileSystem() {}
 
     public IDirectoryStatic Directory { get; }
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileInfo.MoveTo; MockFileSystem.Tests.Wrappers.TestsMemoryFileInfo.Mock_RecordCallsCorrectly; MockFileSystem.Tests.TestsMemoryFileSystem.FileLocking

[Killed] Null coalescing mutation (remove left)
RailManager/src/MockFileSystem/BaseFileSystem.cs:34:50
     public IFileInfo FileInfo(string path) => new MemoryFileInfo(this, path).Mock();
 
     public void Add(string folderPath, DateTime? lastWriteTime = null) =>
-        Add(new MemoryDirectoryEntry(folderPath, lastWriteTime ?? MemoryEntry.DefaultLastWriteTime));
+        Add(new MemoryDirectoryEntry(folderPath, MemoryEntry.DefaultLastWriteTime));
 
     public void Add(string filePath, byte[] binaryContent, DateTime? lastWriteTime = null) =>
killedBy: MockFileSystem.Tests.TestsMemoryFileSystem.SetsLastWriteTime

[Killed] Null coalescing mutation (remove left)
RailManager/src/MockFileSystem/BaseFileSystem.cs:37:49
         Add(new MemoryDirectoryEntry(folderPath, lastWriteTime ?? MemoryEntry.DefaultLastWriteTime));
 
     public void Add(string filePath, byte[] binaryContent, DateTime? lastWriteTime = null) =>
-        Add(new MemoryBinaryFileEntry(filePath, lastWriteTime ?? MemoryEntry.DefaultLastWriteTime, binaryContent));
+        Add(new MemoryBinaryFileEntry(filePath, MemoryEntry.DefaultLastWriteTime, binaryContent));
 
     public void Add(string filePath, string textContent, DateTime? lastWriteTime = null) =>
killedBy: MockFileSystem.Tests.TestsMemoryFileSystem.SetsLastWriteTime

[Killed] Null coalescing mutation (remove left)
RailManager/src/MockFileSystem/BaseFileSystem.cs:40:49
         Add(new MemoryBinaryFileEntry(filePath, lastWriteTime ?? MemoryEntry.DefaultLastWriteTime, binaryContent));
 
     public void Add(string filePath, string textContent, DateTime? lastWriteTime = null) =>
-        Add(new MemoryBinaryFileEntry(filePath, lastWriteTime ?? MemoryEntry.DefaultLastWriteTime, textContent));
+        Add(new MemoryBinaryFileEntry(filePath, MemoryEntry.DefaultLastWriteTime, textContent));
 
     public void Add(string filePath, ZipFileSystem zipFile, DateTime? lastWriteTime = null) =>
killedBy: MockFileSystem.Tests.TestsMemoryFileSystem.SetsLastWriteTime

[Killed] Null coalescing mutation (remove left)
RailManager/src/MockFileSystem/BaseFileSystem.cs:43:46
         Add(new MemoryBinaryFileEntry(filePath, lastWriteTime ?? MemoryEntry.DefaultLastWriteTime, textContent));
 
     public void Add(string filePath, ZipFileSystem zipFile, DateTime? lastWriteTime = null) =>
-        Add(new MemoryZipFileEntry(filePath, lastWriteTime ?? MemoryEntry.DefaultLastWriteTime, zipFile));
+        Add(new MemoryZipFileEntry(filePath, MemoryEntry.DefaultLastWriteTime, zipFile));
 
     public void Add(string filePath, Exception exception, DateTime? lastWriteTime = null) =>
killedBy: MockFileSystem.Tests.TestsMemoryFileSystem.SetsLastWriteTime

[Killed] Null coalescing mutation (remove left)
RailManager/src/MockFileSystem/BaseFileSystem.cs:46:51
         Add(new MemoryZipFileEntry(filePath, lastWriteTime ?? MemoryEntry.DefaultLastWriteTime, zipFile));
 
     public void Add(string filePath, Exception exception, DateTime? lastWriteTime = null) =>
-        Add(new MemoryReadFailFileEntry(filePath, lastWriteTime ?? MemoryEntry.DefaultLastWriteTime, exception));
+        Add(new MemoryReadFailFileEntry(filePath, MemoryEntry.DefaultLastWriteTime, exception));
 
     public void Add(MemoryEntry entry) {
killedBy: MockFileSystem.Tests.TestsMemoryFileSystem.SetsLastWriteTime

[Killed] Negate expression
RailManager/src/MockFileSystem/BaseFileSystem.cs:51:13
     public void Add(MemoryEntry entry) {
         entry = entry with { Path = NormalizePath(entry.Path) };
 
-        if (_Entries.ContainsKey(entry.Path)) {
+        if (!(_Entries.ContainsKey(entry.Path))) {
             throw new InvalidOperationException($"Path '{entry.Path}' already exists.");
         }
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryZipFileStatic.ExtractToDirectory_ThrowWhenSourceNotFoundOrDirectory; MockFileSystem.Tests.Wrappers.TestsMemoryZipFileStatic.Mock_RecordCallsCorrectly; MockFileSystem.Tests.Wrappers.TestsMemoryZipFileStatic.OpenRead_ThrowWhenSourceNotFoundOrDirectory

[Killed] Statement mutation
RailManager/src/MockFileSystem/BaseFileSystem.cs:52:13
         entry = entry with { Path = NormalizePath(entry.Path) };
 
         if (_Entries.ContainsKey(entry.Path)) {
-            throw new InvalidOperationException($"Path '{entry.Path}' already exists.");
+            ;
         }
 
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Create_WhenAddThrows; MockFileSystem.Tests.TestsMemoryFileSystem.Throws_WhenAddedTwice

[Killed] Statement mutation
RailManager/src/MockFileSystem/BaseFileSystem.cs:60:9
             VerifyParents(path, entry.LastWriteTime);
         }
 
-        _Entries.TryAdd(entry.Path, entry);
+        ;
     }
 
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryZipFileStatic.Mock_RecordCallsCorrectly; MockFileSystem.Tests.Wrappers.TestsMemoryZipFileStatic.OpenRead_ReturnsCorrectZipArchive; MockFileSystem.Tests.Wrappers.TestsMemoryZipFileStatic.ExtractToDirectory_ThrowWhenSourceNotZip

[Killed] Statement mutation
RailManager/src/MockFileSystem/BaseFileSystem.cs:65:13
 
     public void AddRange(IEnumerable<MemoryEntry> entries) {
         foreach (var entry in entries) {
-            Add(entry);
+            ;
         }
     }
killedBy: MockFileSystem.Tests.TestsMemoryFileSystem.Enumerate_SpecificWildcardPatterns_MatchesCorrectly

[Killed] Conditional (true) mutation
RailManager/src/MockFileSystem/BaseFileSystem.cs:76:13
 
     public TEntry GetEntry<TEntry>(string path) where TEntry : MemoryEntry =>
         FindEntry<TEntry>(path) ?? throw (
-            typeof(MemoryDirectoryEntry).IsAssignableFrom(typeof(TEntry))
-                ? new DirectoryNotFoundException($"Directory '{path}' not found.")
-                : new FileNotFoundException($"File '{path}' not found.")
+            (true?new DirectoryNotFoundException($"Directory '{path}' not found.")
+:new FileNotFoundException($"File '{path}' not found.")
+)
         );
 
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileInfo.LastWriteTime_WhenNotFound; MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.GetLastWriteTime_ThrowsWhenNotFoundOrDirectory; MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.GetLastWriteTime_ThrowsWhenNotFoundOrDirectory

[Killed] Conditional (false) mutation
RailManager/src/MockFileSystem/BaseFileSystem.cs:76:13
 
     public TEntry GetEntry<TEntry>(string path) where TEntry : MemoryEntry =>
         FindEntry<TEntry>(path) ?? throw (
-            typeof(MemoryDirectoryEntry).IsAssignableFrom(typeof(TEntry))
-                ? new DirectoryNotFoundException($"Directory '{path}' not found.")
-                : new FileNotFoundException($"File '{path}' not found.")
+            (false?new DirectoryNotFoundException($"Directory '{path}' not found.")
+:new FileNotFoundException($"File '{path}' not found.")
+)
         );
 
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryDirectoryStatic.EnumerateDirectories_ThrowsWhenNotFound

[Killed] String mutation
RailManager/src/MockFileSystem/BaseFileSystem.cs:77:50
     public TEntry GetEntry<TEntry>(string path) where TEntry : MemoryEntry =>
         FindEntry<TEntry>(path) ?? throw (
             typeof(MemoryDirectoryEntry).IsAssignableFrom(typeof(TEntry))
-                ? new DirectoryNotFoundException($"Directory '{path}' not found.")
+                ? new DirectoryNotFoundException($"")
                 : new FileNotFoundException($"File '{path}' not found.")
         );
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryDirectoryStatic.EnumerateDirectories_ThrowsWhenNotFound

[Killed] Equality mutation
RailManager/src/MockFileSystem/BaseFileSystem.cs:85:13
 
     public void UpdateEntry<TEntry>(string path, Updater<TEntry> updater) where TEntry : MemoryEntry {
         var entry = updater(GetEntry<TEntry>(path));
-        if (entry.Path != path) {
+        if (entry.Path == path) {
             _Entries.TryRemove(path, out _);
         }
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileInfo.MoveTo

[Killed] Block removal mutation
RailManager/src/MockFileSystem/BaseFileSystem.cs:85:33
 
     public void UpdateEntry<TEntry>(string path, Updater<TEntry> updater) where TEntry : MemoryEntry {
         var entry = updater(GetEntry<TEntry>(path));
-        if (entry.Path != path) {
-            _Entries.TryRemove(path, out _);
-        }
+        if (entry.Path != path) {}
 
         _Entries[entry.Path] = entry;
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileInfo.MoveTo

[Killed] Negate expression
RailManager/src/MockFileSystem/BaseFileSystem.cs:94:13
 
     public void DeleteEntry<TEntry>(string path)  where TEntry : MemoryEntry {
         _Entries.TryGetValue(path, out var entry);
-        if (entry is MemoryDirectoryEntry) {
+        if (!(entry is MemoryDirectoryEntry)) {
             throw new InvalidOperationException($"Entry at '{path}' is directory.");
         }
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Delete_ThrowsWhenDirectory; MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Mock_RecordCallsCorrectly; MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Delete_ThrowsWhenLocked

[Killed] Statement mutation
RailManager/src/MockFileSystem/BaseFileSystem.cs:95:13
     public void DeleteEntry<TEntry>(string path)  where TEntry : MemoryEntry {
         _Entries.TryGetValue(path, out var entry);
         if (entry is MemoryDirectoryEntry) {
-            throw new InvalidOperationException($"Entry at '{path}' is directory.");
+            ;
         }
 
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Delete_ThrowsWhenDirectory

[Killed] Equality mutation
RailManager/src/MockFileSystem/BaseFileSystem.cs:98:13
             throw new InvalidOperationException($"Entry at '{path}' is directory.");
         }
 
-        if (entry is MemoryFileEntry { Locked: true }) {
+        if (entry is not MemoryFileEntry { Locked: true }) {
             throw new InvalidOperationException($"File at '{path}' is locked.");
         }
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Mock_RecordCallsCorrectly; MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Delete_ThrowsWhenLocked; MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Delete_DoNothingWhenNotFound

[Killed] Boolean mutation
RailManager/src/MockFileSystem/BaseFileSystem.cs:98:48
             throw new InvalidOperationException($"Entry at '{path}' is directory.");
         }
 
-        if (entry is MemoryFileEntry { Locked: true }) {
+        if (entry is MemoryFileEntry { Locked: false }) {
             throw new InvalidOperationException($"File at '{path}' is locked.");
         }
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Mock_RecordCallsCorrectly; MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Delete_ThrowsWhenLocked; MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Delete_WhenValid

[Killed] Statement mutation
RailManager/src/MockFileSystem/BaseFileSystem.cs:99:13
         }
 
         if (entry is MemoryFileEntry { Locked: true }) {
-            throw new InvalidOperationException($"File at '{path}' is locked.");
+            ;
         }
 
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Delete_ThrowsWhenLocked

[Killed] Negate expression
RailManager/src/MockFileSystem/BaseFileSystem.cs:107:13
     }
 
     public IEnumerable<MemoryEntry> EnumerateEntries(string path, string searchPattern, SearchOption searchOption) {
-        if (string.IsNullOrEmpty(searchPattern)) {
+        if (!(string.IsNullOrEmpty(searchPattern))) {
             throw new ArgumentNullException(nameof(searchPattern), "Search pattern cannot be empty.");
         }
killedBy: MockFileSystem.Tests.TestsMemoryFileSystem.Enumerate_SpecificWildcardPatterns_MatchesCorrectly; MockFileSystem.Tests.TestsMemoryFileSystem.ReturnsCorrectInstanceOfDirectoryInfo; MockFileSystem.Tests.TestsMemoryFileSystem.Throws_InvalidSearchPattern

[Killed] Statement mutation
RailManager/src/MockFileSystem/BaseFileSystem.cs:108:13
 
     public IEnumerable<MemoryEntry> EnumerateEntries(string path, string searchPattern, SearchOption searchOption) {
         if (string.IsNullOrEmpty(searchPattern)) {
-            throw new ArgumentNullException(nameof(searchPattern), "Search pattern cannot be empty.");
+            ;
         }
 
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryDirectoryInfo.EnumerateFiles_ThrowEmptyPattern

[Killed] Statement mutation
RailManager/src/MockFileSystem/BaseFileSystem.cs:113:9
 
         path = NormalizePath(path);
 
-        GetEntry<MemoryDirectoryEntry>(path);
+        ;
 
         // _Items.Keys = [@"C:\", @"C:\Foo", @"C:\Test", @"C:\Test\Dir1", @"C:\Test\Dir2", @"C:\Test\File1.txt", @"C:\Test\Dir3", @"C:\Test\Dir3\SubDir", @"C:\Test\Dir3\File2.txt" ]
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryDirectoryStatic.EnumerateDirectories_ThrowsWhenNotFound

[Killed] String mutation
RailManager/src/MockFileSystem/BaseFileSystem.cs:153:41
     private static Regex ToRegex(string searchPattern) {
         var invalidPathChars = Path.GetInvalidFileNameChars();
         if (searchPattern.Any(o => (o != '?') & (o != '*') && invalidPathChars.Contains(o))) {
-            throw new ArgumentException("Invalid search pattern.");
+            throw new ArgumentException("");
         }
 
killedBy: MockFileSystem.Tests.TestsMemoryFileSystem.Throws_InvalidSearchPattern

[Killed] String mutation
RailManager/src/MockFileSystem/BaseFileSystem.cs:157:15
         }
 
         var regexPattern = searchPattern == "*.*"
-            ? $"[^{Path.DirectorySeparatorChar}{Path.AltDirectorySeparatorChar}]*"
+            ? $""
             : Regex.Escape(searchPattern).Replace("\\*", ".*").Replace("\\?", ".");
 
killedBy: MockFileSystem.Tests.TestsMemoryFileSystem.Enumerate_SpecificWildcardPatterns_MatchesCorrectly; MockFileSystem.Tests.TestsMemoryFileSystem.Enumerate_Anything_ReturnsAllInDirectory; MockFileSystem.Tests.Wrappers.TestsMemoryDirectoryStatic.EnumerateDirectories

[Killed] String mutation
RailManager/src/MockFileSystem/BaseFileSystem.cs:158:79
 
         var regexPattern = searchPattern == "*.*"
             ? $"[^{Path.DirectorySeparatorChar}{Path.AltDirectorySeparatorChar}]*"
-            : Regex.Escape(searchPattern).Replace("\\*", ".*").Replace("\\?", ".");
+            : Regex.Escape(searchPattern).Replace("\\*", ".*").Replace("\\?", "");
 
         return new("^" + regexPattern + "$", RegexOptions.IgnoreCase);
killedBy: MockFileSystem.Tests.TestsMemoryFileSystem.Enumerate_SpecificWildcardPatterns_MatchesCorrectly

[Killed] Statement mutation
RailManager/src/MockFileSystem/BaseFileSystem.cs:173:9
 
     private void SetLock(string path, bool locked) {
         path = NormalizePath(path);
-        UpdateEntry<MemoryFileEntry>(path, o => o with { Locked = locked });
+        ;
     }
 
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Delete_ThrowsWhenLocked; MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Move_WhenSourceLocked; MockFileSystem.Tests.TestsMemoryFileSystem.FileLocking

[Killed] Negate expression
RailManager/src/MockFileSystem/BaseFileSystem.cs:187:17
 
         while (paths.Any()) {
             var directoryPath = paths.Pop()!;
-            if (_Entries.TryGetValue(directoryPath, out var directoryEntry)) {
+            if (!(_Entries.TryGetValue(directoryPath, out var directoryEntry))) {
                 if (directoryEntry is not MemoryDirectoryEntry) {
                     throw new InvalidOperationException($"Path '{directoryPath}' is a file, not a directory.");
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileInfo.MoveTo; MockFileSystem.Tests.Wrappers.TestsMemoryFileInfo.FullName; MockFileSystem.Tests.Wrappers.TestsMemoryFileInfo.LastWriteTime_WhenNotFound

[Killed] Equality mutation
RailManager/src/MockFileSystem/BaseFileSystem.cs:188:21
         while (paths.Any()) {
             var directoryPath = paths.Pop()!;
             if (_Entries.TryGetValue(directoryPath, out var directoryEntry)) {
-                if (directoryEntry is not MemoryDirectoryEntry) {
+                if (directoryEntry is MemoryDirectoryEntry) {
                     throw new InvalidOperationException($"Path '{directoryPath}' is a file, not a directory.");
                 }
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Delete_ThrowsWhenDirectory; MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.ReadAllText_WhenValid; MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Exists

[Killed] Statement mutation
RailManager/src/MockFileSystem/BaseFileSystem.cs:189:21
             var directoryPath = paths.Pop()!;
             if (_Entries.TryGetValue(directoryPath, out var directoryEntry)) {
                 if (directoryEntry is not MemoryDirectoryEntry) {
-                    throw new InvalidOperationException($"Path '{directoryPath}' is a file, not a directory.");
+                    ;
                 }
 
killedBy: MockFileSystem.Tests.TestsMemoryFileSystem.Throws_WhenTryingToAddToInvalidPath

[Killed] Statement mutation
RailManager/src/MockFileSystem/BaseFileSystem.cs:194:17
 
                 _Entries[directoryPath] = directoryEntry with { LastWriteTime = lastWriteTime };
             } else {
-                _Entries.TryAdd(directoryPath, new MemoryDirectoryEntry(directoryPath, lastWriteTime));
+                ;
             }
         }
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryDirectoryStatic.EnumerateDirectories; MockFileSystem.Tests.Wrappers.TestsMemoryDirectoryStatic.Mock_RecordCallsCorrectly; MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Create_WhenSucceed

[Killed] Linq method mutation (OrderBy() to OrderByDescending())
RailManager/src/MockFileSystem/BaseFileSystem.cs:199:56
         }
     }
 
-    public IEnumerator<MemoryEntry> GetEnumerator() => _Entries.Values.OrderBy(o => o.Path).GetEnumerator();
+    public IEnumerator<MemoryEntry> GetEnumerator() => _Entries.Values.OrderByDescending(o => o.Path).GetEnumerator();
 
     IEnumerator IEnumerable.GetEnumerator() => GetEnumerator();
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Create_WhenSucceed; MockFileSystem.Tests.TestsMemoryFileSystem.NormalizePathCorrectly; MockFileSystem.Tests.TestsMemoryFileSystem.CurrentDirectory_AddParents
