[Killed] Null coalescing mutation (remove left)
RailManager/src/MockFileSystem/MemoryFileSystem.cs:11:84
 [PublicAPI]
 public sealed class MemoryFileSystem : BaseFileSystem
 {
-    public MemoryFileSystem(string? currentDirectory = null) => CurrentDirectory = currentDirectory ?? "C:\\";
+    public MemoryFileSystem(string? currentDirectory = null) => CurrentDirectory = "C:\\";
 
     private string _CurrentDirectory = null!;
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryDirectoryStatic.Mock_RecordCallsCorrectly; MockFileSystem.Tests.Wrappers.TestsMemoryDirectoryStatic.GetCurrentDirectory_ReturnsMemoryFsCurrentDirectory; MockFileSystem.Tests.TestsMemoryFileSystem.NormalizeRelativePathToCurrent

[Killed] Statement mutation
RailManager/src/MockFileSystem/MemoryFileSystem.cs:20:13
         [ExcludeFromCodeCoverage]
         set {
             var normalized = NormalizePath(value);
-            VerifyParents(normalized, MemoryEntry.DefaultLastWriteTime);
+            ;
             _CurrentDirectory = normalized;
         }
killedBy: MockFileSystem.Tests.TestsMemoryFileSystem.NormalizePathCorrectly; MockFileSystem.Tests.TestsMemoryFileSystem.CurrentDirectory_AddParents

[Killed] Equality mutation
RailManager/src/MockFileSystem/MemoryFileSystem.cs:32:13
         }
 
         path = Path.GetFullPath(path);
-        if (path.Length > 3) { // Trim trailing slash for non-root paths
+        if (path.Length >= 3) { // Trim trailing slash for non-root paths
             path = path.TrimEnd('\\');
         }
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryZipFileStatic.ExtractToDirectory_CreatesCorrectEntries; MockFileSystem.Tests.Wrappers.TestsMemoryFileInfo.MoveTo; MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Create_WhenSucceed
