[Killed] Statement mutation
src/MockFileSystem/Wrappers/MemoryDirectoryStatic.cs:15:9
 {
     public IDirectoryStatic Mock() {
         var mock = Substitute.For<IDirectoryStatic>();
-        mock.Exists(Arg.Any<string>()).Returns(o => Exists(o.Arg<string>()));
+        ;
         mock.EnumerateDirectories(Arg.Any<string>()).Returns(o => EnumerateDirectories(o.Arg<string>()));
         mock.GetCurrentDirectory().Returns(_ => GetCurrentDirectory());
killedBy: MockFileSystem.Tests.TestsMemoryFileSystem.NormalizeRelativePathToCurrent; MockFileSystem.Tests.Wrappers.TestsMemoryDirectoryStatic.Mock_RecordCallsCorrectly

[Killed] Statement mutation
src/MockFileSystem/Wrappers/MemoryDirectoryStatic.cs:16:9
     public IDirectoryStatic Mock() {
         var mock = Substitute.For<IDirectoryStatic>();
         mock.Exists(Arg.Any<string>()).Returns(o => Exists(o.Arg<string>()));
-        mock.EnumerateDirectories(Arg.Any<string>()).Returns(o => EnumerateDirectories(o.Arg<string>()));
+        ;
         mock.GetCurrentDirectory().Returns(_ => GetCurrentDirectory());
         return mock;
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryDirectoryStatic.Mock_RecordCallsCorrectly

[Killed] Statement mutation
src/MockFileSystem/Wrappers/MemoryDirectoryStatic.cs:17:9
         var mock = Substitute.For<IDirectoryStatic>();
         mock.Exists(Arg.Any<string>()).Returns(o => Exists(o.Arg<string>()));
         mock.EnumerateDirectories(Arg.Any<string>()).Returns(o => EnumerateDirectories(o.Arg<string>()));
-        mock.GetCurrentDirectory().Returns(_ => GetCurrentDirectory());
+        ;
         return mock;
     }
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryDirectoryStatic.Mock_RecordCallsCorrectly

[Killed] Equality mutation
src/MockFileSystem/Wrappers/MemoryDirectoryStatic.cs:21:40
         return mock;
     }
 
-    public bool Exists(string path) => fileSystem.FindEntry<MemoryDirectoryEntry>(path) != null;
+    public bool Exists(string path) => fileSystem.FindEntry<MemoryDirectoryEntry>(path) == null;
 
     public IEnumerable<string> EnumerateDirectories(string path) =>
killedBy: MockFileSystem.Tests.TestsMemoryFileSystem.NormalizeRelativePathToCurrent; MockFileSystem.Tests.Wrappers.TestsMemoryDirectoryStatic.Exists; MockFileSystem.Tests.Wrappers.TestsMemoryDirectoryStatic.Exists

[Killed] String mutation
src/MockFileSystem/Wrappers/MemoryDirectoryStatic.cs:28:47
 
     public string GetCurrentDirectory() => fileSystem is MemoryFileSystem memoryFileSystem
         ? memoryFileSystem.CurrentDirectory
-        : throw new InvalidOperationException($"Only {typeof(MemoryFileSystem)} supports concept of '{nameof(MemoryFileSystem.CurrentDirectory)}'.");
+        : throw new InvalidOperationException($"");
 }
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryDirectoryStatic.GetCurrentDirectory_ThrowsForNonMemoryFs
