[Killed] Statement mutation
src/MockFileSystem/Wrappers/MemoryFileInfo.cs:12:9
 {
     public IFileInfo Mock() {
         var mock = Substitute.For<IFileInfo>();
-        mock.LastWriteTime.Returns(_ => LastWriteTime);
+        ;
         mock.FullName.Returns(_ => FullName);
         mock.When(o => o.MoveTo(Arg.Any<string>())).Do(o => MoveTo(o.Arg<string>()));
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileInfo.Mock_RecordCallsCorrectly

[Killed] Statement mutation
src/MockFileSystem/Wrappers/MemoryFileInfo.cs:13:9
     public IFileInfo Mock() {
         var mock = Substitute.For<IFileInfo>();
         mock.LastWriteTime.Returns(_ => LastWriteTime);
-        mock.FullName.Returns(_ => FullName);
+        ;
         mock.When(o => o.MoveTo(Arg.Any<string>())).Do(o => MoveTo(o.Arg<string>()));
         return mock;
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryDirectoryInfo.EnumerateFiles_TopDirectoryOnly; MockFileSystem.Tests.Wrappers.TestsMemoryDirectoryInfo.EnumerateFiles_AllDirectories; MockFileSystem.Tests.TestsMemoryFileSystem.Enumerate_SpecificWildcardPatterns_MatchesCorrectly

[Killed] Statement mutation
src/MockFileSystem/Wrappers/MemoryFileInfo.cs:14:9
         var mock = Substitute.For<IFileInfo>();
         mock.LastWriteTime.Returns(_ => LastWriteTime);
         mock.FullName.Returns(_ => FullName);
-        mock.When(o => o.MoveTo(Arg.Any<string>())).Do(o => MoveTo(o.Arg<string>()));
+        ;
         return mock;
     }
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileInfo.Mock_RecordCallsCorrectly
