[Killed] Statement mutation
src/MockFileSystem/Wrappers/MemoryFileStatic.cs:16:9
 {
     public IFileStatic Mock() {
         var mock = Substitute.For<IFileStatic>();
-        mock.Exists(Arg.Any<string>()).Returns(o => Exists(o.Arg<string>()));
+        ;
         mock.ReadAllText(Arg.Any<string>()).Returns(o => ReadAllText(o.Arg<string>()));
         mock.When(o => o.WriteAllText(Arg.Any<string>(), Arg.Any<string>())).Do(o => WriteAllText(o.ArgAt<string>(0), o.ArgAt<string>(1)));
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Mock_RecordCallsCorrectly

[Killed] Statement mutation
src/MockFileSystem/Wrappers/MemoryFileStatic.cs:17:9
     public IFileStatic Mock() {
         var mock = Substitute.For<IFileStatic>();
         mock.Exists(Arg.Any<string>()).Returns(o => Exists(o.Arg<string>()));
-        mock.ReadAllText(Arg.Any<string>()).Returns(o => ReadAllText(o.Arg<string>()));
+        ;
         mock.When(o => o.WriteAllText(Arg.Any<string>(), Arg.Any<string>())).Do(o => WriteAllText(o.ArgAt<string>(0), o.ArgAt<string>(1)));
         mock.GetLastWriteTime(Arg.Any<string>()).Returns(o => GetLastWriteTime(o.Arg<string>()));
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Mock_RecordCallsCorrectly

[Killed] Statement mutation
src/MockFileSystem/Wrappers/MemoryFileStatic.cs:18:9
         var mock = Substitute.For<IFileStatic>();
         mock.Exists(Arg.Any<string>()).Returns(o => Exists(o.Arg<string>()));
         mock.ReadAllText(Arg.Any<string>()).Returns(o => ReadAllText(o.Arg<string>()));
-        mock.When(o => o.WriteAllText(Arg.Any<string>(), Arg.Any<string>())).Do(o => WriteAllText(o.ArgAt<string>(0), o.ArgAt<string>(1)));
+        ;
         mock.GetLastWriteTime(Arg.Any<string>()).Returns(o => GetLastWriteTime(o.Arg<string>()));
         mock.When(o => o.Delete(Arg.Any<string>())).Do(o => Delete(o.Arg<string>()));
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Mock_RecordCallsCorrectly

[Killed] Statement mutation
src/MockFileSystem/Wrappers/MemoryFileStatic.cs:19:9
         mock.Exists(Arg.Any<string>()).Returns(o => Exists(o.Arg<string>()));
         mock.ReadAllText(Arg.Any<string>()).Returns(o => ReadAllText(o.Arg<string>()));
         mock.When(o => o.WriteAllText(Arg.Any<string>(), Arg.Any<string>())).Do(o => WriteAllText(o.ArgAt<string>(0), o.ArgAt<string>(1)));
-        mock.GetLastWriteTime(Arg.Any<string>()).Returns(o => GetLastWriteTime(o.Arg<string>()));
+        ;
         mock.When(o => o.Delete(Arg.Any<string>())).Do(o => Delete(o.Arg<string>()));
         mock.When(o => o.Move(Arg.Any<string>(), Arg.Any<string>())).Do(o => Move(o.ArgAt<string>(0), o.ArgAt<string>(1)));
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Mock_RecordCallsCorrectly

[Killed] Statement mutation
src/MockFileSystem/Wrappers/MemoryFileStatic.cs:20:9
         mock.ReadAllText(Arg.Any<string>()).Returns(o => ReadAllText(o.Arg<string>()));
         mock.When(o => o.WriteAllText(Arg.Any<string>(), Arg.Any<string>())).Do(o => WriteAllText(o.ArgAt<string>(0), o.ArgAt<string>(1)));
         mock.GetLastWriteTime(Arg.Any<string>()).Returns(o => GetLastWriteTime(o.Arg<string>()));
-        mock.When(o => o.Delete(Arg.Any<string>())).Do(o => Delete(o.Arg<string>()));
+        ;
         mock.When(o => o.Move(Arg.Any<string>(), Arg.Any<string>())).Do(o => Move(o.ArgAt<string>(0), o.ArgAt<string>(1)));
         mock.Create(Arg.Any<string>()).Returns(o => Create(o.Arg<string>()));
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Mock_RecordCallsCorrectly

[Killed] Statement mutation
src/MockFileSystem/Wrappers/MemoryFileStatic.cs:21:9
         mock.When(o => o.WriteAllText(Arg.Any<string>(), Arg.Any<string>())).Do(o => WriteAllText(o.ArgAt<string>(0), o.ArgAt<string>(1)));
         mock.GetLastWriteTime(Arg.Any<string>()).Returns(o => GetLastWriteTime(o.Arg<string>()));
         mock.When(o => o.Delete(Arg.Any<string>())).Do(o => Delete(o.Arg<string>()));
-        mock.When(o => o.Move(Arg.Any<string>(), Arg.Any<string>())).Do(o => Move(o.ArgAt<string>(0), o.ArgAt<string>(1)));
+        ;
         mock.Create(Arg.Any<string>()).Returns(o => Create(o.Arg<string>()));
         return mock;
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileInfo.MoveTo; MockFileSystem.Tests.Wrappers.TestsMemoryFileInfo.Mock_RecordCallsCorrectly; MockFileSystem.Tests.TestsMemoryFileSystem.FileLocking

[Killed] Statement mutation
src/MockFileSystem/Wrappers/MemoryFileStatic.cs:22:9
         mock.GetLastWriteTime(Arg.Any<string>()).Returns(o => GetLastWriteTime(o.Arg<string>()));
         mock.When(o => o.Delete(Arg.Any<string>())).Do(o => Delete(o.Arg<string>()));
         mock.When(o => o.Move(Arg.Any<string>(), Arg.Any<string>())).Do(o => Move(o.ArgAt<string>(0), o.ArgAt<string>(1)));
-        mock.Create(Arg.Any<string>()).Returns(o => Create(o.Arg<string>()));
+        ;
         return mock;
     }
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Mock_RecordCallsCorrectly

[Killed] Equality mutation
src/MockFileSystem/Wrappers/MemoryFileStatic.cs:26:40
         return mock;
     }
 
-    public bool Exists(string path) => fileSystem.FindEntry<MemoryFileEntry>(path) != null;
+    public bool Exists(string path) => fileSystem.FindEntry<MemoryFileEntry>(path) == null;
 
     public string ReadAllText(string path) {
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Exists; MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Exists; MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Exists

[Killed] Equality mutation
src/MockFileSystem/Wrappers/MemoryFileStatic.cs:38:13
     }
 
     public void WriteAllText(string path, string content) {
-        if (fileSystem.FindEntry<MemoryBinaryFileEntry>(path) == null) {
+        if (fileSystem.FindEntry<MemoryBinaryFileEntry>(path) != null) {
             fileSystem.Add(path, content);
         } else {
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Mock_RecordCallsCorrectly; MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.WriteAllText_OverrideExisting; MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.WriteAllText_CreateNew

[Killed] Statement mutation
src/MockFileSystem/Wrappers/MemoryFileStatic.cs:39:13
 
     public void WriteAllText(string path, string content) {
         if (fileSystem.FindEntry<MemoryBinaryFileEntry>(path) == null) {
-            fileSystem.Add(path, content);
+            ;
         } else {
             fileSystem.UpdateEntry<MemoryBinaryFileEntry>(path, o => o with { Content = MemoryBinaryFileEntry.GetBytes(content) });
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Mock_RecordCallsCorrectly; MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.WriteAllText_CreateNew

[Killed] Statement mutation
src/MockFileSystem/Wrappers/MemoryFileStatic.cs:41:13
         if (fileSystem.FindEntry<MemoryBinaryFileEntry>(path) == null) {
             fileSystem.Add(path, content);
         } else {
-            fileSystem.UpdateEntry<MemoryBinaryFileEntry>(path, o => o with { Content = MemoryBinaryFileEntry.GetBytes(content) });
+            ;
         }
     }
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.WriteAllText_OverrideExisting

[Killed] Negate expression
src/MockFileSystem/Wrappers/MemoryFileStatic.cs:55:17
 
         lock (fileSystem) {
             var source = fileSystem.GetEntry<MemoryFileEntry>(sourceFileName);
-            if (source.Locked) {
+            if (!(source.Locked)) {
                 throw new InvalidOperationException($"File at '{sourceFileName}' is locked.");
             }
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileInfo.MoveTo; MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Move_WhenValid; MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Move_WhenDestinationExists

[Killed] Statement mutation
src/MockFileSystem/Wrappers/MemoryFileStatic.cs:56:17
         lock (fileSystem) {
             var source = fileSystem.GetEntry<MemoryFileEntry>(sourceFileName);
             if (source.Locked) {
-                throw new InvalidOperationException($"File at '{sourceFileName}' is locked.");
+                ;
             }
 
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Move_WhenSourceLocked; MockFileSystem.Tests.TestsMemoryFileSystem.FileLocking

[Killed] String mutation
src/MockFileSystem/Wrappers/MemoryFileStatic.cs:56:53
         lock (fileSystem) {
             var source = fileSystem.GetEntry<MemoryFileEntry>(sourceFileName);
             if (source.Locked) {
-                throw new InvalidOperationException($"File at '{sourceFileName}' is locked.");
+                throw new InvalidOperationException($"");
             }
 
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Move_WhenSourceLocked; MockFileSystem.Tests.TestsMemoryFileSystem.FileLocking

[Killed] Equality mutation
src/MockFileSystem/Wrappers/MemoryFileStatic.cs:59:17
                 throw new InvalidOperationException($"File at '{sourceFileName}' is locked.");
             }
 
-            if (fileSystem.FindEntry<MemoryFileEntry>(destFileName) != null) {
+            if (fileSystem.FindEntry<MemoryFileEntry>(destFileName) == null) {
                 throw new InvalidOperationException($"Destination '{destFileName}' exists.");
             }
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileInfo.MoveTo; MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Move_WhenValid; MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Move_WhenDestinationExists

[Killed] Statement mutation
src/MockFileSystem/Wrappers/MemoryFileStatic.cs:60:17
             }
 
             if (fileSystem.FindEntry<MemoryFileEntry>(destFileName) != null) {
-                throw new InvalidOperationException($"Destination '{destFileName}' exists.");
+                ;
             }
 
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Move_WhenDestinationExists

[Killed] Statement mutation
src/MockFileSystem/Wrappers/MemoryFileStatic.cs:63:13
                 throw new InvalidOperationException($"Destination '{destFileName}' exists.");
             }
 
-            fileSystem.UpdateEntry<MemoryFileEntry>(sourceFileName, o => o with { Path = destFileName });
+            ;
         }
     }
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileInfo.MoveTo; MockFileSystem.Tests.Wrappers.TestsMemoryFileInfo.Mock_RecordCallsCorrectly; MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Move_WhenValid

[Killed] Statement mutation
src/MockFileSystem/Wrappers/MemoryFileStatic.cs:71:13
         path = fileSystem.NormalizePath(path);
 
         lock (fileSystem) {
-            fileSystem.Add(path, Array.Empty<byte>());
+            ;
 
             var data = new List<byte>();
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Mock_RecordCallsCorrectly; MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Create_WhenAddThrows; MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Create_WhenSucceed

[Killed] Linq method mutation (Take() to Skip())
src/MockFileSystem/Wrappers/MemoryFileStatic.cs:74:82
             fileSystem.Add(path, Array.Empty<byte>());
 
             var data = new List<byte>();
-            return new MemoryFileStream((buffer, offset, count) => data.AddRange(buffer.Skip(offset).Take(count)),
+            return new MemoryFileStream((buffer, offset, count) => data.AddRange(buffer.Skip(offset).Skip(count)),
                 () => fileSystem.UpdateEntry<MemoryBinaryFileEntry>(path, o => o with { Content = data.ToArray() }));
         }
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Mock_RecordCallsCorrectly; MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Create_WhenSucceed

[Killed] Linq method mutation (Skip() to Take())
src/MockFileSystem/Wrappers/MemoryFileStatic.cs:74:82
             fileSystem.Add(path, Array.Empty<byte>());
 
             var data = new List<byte>();
-            return new MemoryFileStream((buffer, offset, count) => data.AddRange(buffer.Skip(offset).Take(count)),
+            return new MemoryFileStream((buffer, offset, count) => data.AddRange(buffer.Take(offset).Take(count)),
                 () => fileSystem.UpdateEntry<MemoryBinaryFileEntry>(path, o => o with { Content = data.ToArray() }));
         }
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Mock_RecordCallsCorrectly; MockFileSystem.Tests.Wrappers.TestsMemoryFileStatic.Create_WhenSucceed
