[Killed] Conditional (true) mutation
src/MockFileSystem/Wrappers/MemoryZipArchiveEntry.cs:12:9
 public sealed class MemoryZipArchiveEntry(MemoryFileEntry file) : IZipArchiveEntry
 {
     public static IZipArchiveEntry? Create(MemoryFileEntry? file) =>
-        file != null ? new MemoryZipArchiveEntry(file).Mock() : null;
+        (true?new MemoryZipArchiveEntry(file).Mock() :null);
 
     private IZipArchiveEntry Mock() {
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryZipArchive.Mock_CallBaseAndRecordCallsCorrectly; MockFileSystem.Tests.Wrappers.TestsMemoryZipArchive.GetEntry_ReturnNull_WhenNotFound

[Killed] Equality mutation
src/MockFileSystem/Wrappers/MemoryZipArchiveEntry.cs:12:9
 public sealed class MemoryZipArchiveEntry(MemoryFileEntry file) : IZipArchiveEntry
 {
     public static IZipArchiveEntry? Create(MemoryFileEntry? file) =>
-        file != null ? new MemoryZipArchiveEntry(file).Mock() : null;
+        file == null ? new MemoryZipArchiveEntry(file).Mock() : null;
 
     private IZipArchiveEntry Mock() {
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryZipArchive.Mock_CallBaseAndRecordCallsCorrectly; MockFileSystem.Tests.Wrappers.TestsMemoryZipArchive.GetEntry_ReturnsCorrectZipArchiveEntry; MockFileSystem.Tests.Wrappers.TestsMemoryZipArchive.GetEntry_ReturnNull_WhenNotFound
