[Killed] Statement mutation
src/MockFileSystem/Wrappers/MemoryZipFileStatic.cs:13:9
 {
     public IZipFileStatic Mock() {
         var mock = Substitute.For<IZipFileStatic>();
-        mock.When(o => o.ExtractToDirectory(Arg.Any<string>(), Arg.Any<string>())).Do(o => ExtractToDirectory(o.ArgAt<string>(0), o.ArgAt<string>(1)));
+        ;
         mock.OpenRead(Arg.Any<string>()).Returns(o => OpenRead(o.Arg<string>()));
         return mock;
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryZipFileStatic.Mock_RecordCallsCorrectly

[Killed] Statement mutation
src/MockFileSystem/Wrappers/MemoryZipFileStatic.cs:14:9
     public IZipFileStatic Mock() {
         var mock = Substitute.For<IZipFileStatic>();
         mock.When(o => o.ExtractToDirectory(Arg.Any<string>(), Arg.Any<string>())).Do(o => ExtractToDirectory(o.ArgAt<string>(0), o.ArgAt<string>(1)));
-        mock.OpenRead(Arg.Any<string>()).Returns(o => OpenRead(o.Arg<string>()));
+        ;
         return mock;
     }
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryZipFileStatic.Mock_RecordCallsCorrectly
