[Killed] Negate expression
RailManager/src/MockFileSystem/ZipFileSystem.cs:11:13
 public sealed class ZipFileSystem : BaseFileSystem
 {
     internal override string NormalizePath(string path) {
-        if (path.Contains(':')) {
+        if (!(path.Contains(':'))) {
             throw new ArgumentException("Zip file do not support absolute paths.");
         }
killedBy: MockFileSystem.Tests.Wrappers.TestsMemoryZipArchive.Mock_CallBaseAndRecordCallsCorrectly; MockFileSystem.Tests.Wrappers.TestsMemoryZipArchive.Entries_EnumerateCorrectly; MockFileSystem.Tests.Wrappers.TestsMemoryZipArchive.GetEntry_ReturnsCorrectZipArchiveEntry
