[Killed] Equality mutation
src/RailManager/Features/AssemblyCompiler.cs:68:13
         InvokeCompiler compilerInvoker, ILogger logger, string outputPath, ICollection<string> sourceFiles, ICollection<string> referenceAssemblies,
         string[] resources
     ) {
-        if (sourceFiles.Count == 0) {
+        if (sourceFiles.Count != 0) {
             logger.Error("No source files provided for assembly compilation at {outputPath}.", outputPath);
             return false;
killedBy: RailManager.Tests.Features.TestAssemblyCompiler.CompileAssemblyWhenNoSourcesProvided; RailManager.Tests.Features.TestAssemblyCompiler.CompileAssemblyWhenSuccessful

[Killed] Statement mutation
src/RailManager/Features/AssemblyCompiler.cs:76:9
         logger.Information("Compiling assembly {outputPath} ...", outputPath);
         logger.Debug("References:\n{references}", string.Join("\n", referenceAssemblies));
         logger.Debug("Sources:\n{sources}", string.Join("\n", sourceFiles));
-        logger.Debug("Resources:\n{sources}", string.Join("\n", resources));
+        ;
 
         var args = CompilerArguments(outputPath, sourceFiles, referenceAssemblies, resources);
killedBy: RailManager.Tests.Features.TestAssemblyCompiler.CompileAssemblyWhenSuccessful

[Killed] String mutation
src/RailManager/Features/AssemblyCompiler.cs:76:59
         logger.Information("Compiling assembly {outputPath} ...", outputPath);
         logger.Debug("References:\n{references}", string.Join("\n", referenceAssemblies));
         logger.Debug("Sources:\n{sources}", string.Join("\n", sourceFiles));
-        logger.Debug("Resources:\n{sources}", string.Join("\n", resources));
+        logger.Debug("Resources:\n{sources}", string.Join("", resources));
 
         var args = CompilerArguments(outputPath, sourceFiles, referenceAssemblies, resources);
killedBy: RailManager.Tests.Features.TestAssemblyCompiler.CompileAssemblyWhenSuccessful

[Killed] String mutation
src/RailManager/Features/AssemblyCompiler.cs:87:14
         }
 
         var messages = sb.ToString();
-        if (!string.IsNullOrEmpty(messages)) {
+        if (!(messages!=null)) {
             logger.Write(result ? LogEventLevel.Debug : LogEventLevel.Information, "Compilation messages:\r\n{messages}", messages);
         }
killedBy: RailManager.Tests.Features.TestAssemblyCompiler.CompileAssemblyWhenSuccessful; RailManager.Tests.Features.TestAssemblyCompiler.CompileAssemblyWhenFailed

[Killed] String mutation
src/RailManager/Features/AssemblyCompiler.cs:88:84
 
         var messages = sb.ToString();
         if (!string.IsNullOrEmpty(messages)) {
-            logger.Write(result ? LogEventLevel.Debug : LogEventLevel.Information, "Compilation messages:\r\n{messages}", messages);
+            logger.Write(result ? LogEventLevel.Debug : LogEventLevel.Information, "", messages);
         }
 
killedBy: RailManager.Tests.Features.TestAssemblyCompiler.CompileAssemblyWhenSuccessful; RailManager.Tests.Features.TestAssemblyCompiler.CompileAssemblyWhenFailed

[Killed] String mutation
src/RailManager/Features/AssemblyCompiler.cs:119:9
         "-optimize",
         $"-out:{assemblyPath}",
         $"-reference:{string.Join(",", references)}",
-        "-target:library",
+        "",
         "-warn:4",
         ..resources
killedBy: RailManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.Factory; RailManager.Tests.Features.TestAssemblyCompiler.CompileAssemblyWhenSuccessful; RailManager.Tests.Features.TestAssemblyCompiler.CompileAssemblyWhenFailed
