[Killed] String mutation
src/RailManager/Features/Bootstrapper.cs:44:60
         extractMods();
         ModDefinitions = loadDefinitions();
 
-        factory.PatchCategory(typeof(ModManager).Assembly, "LogManager");
+        factory.PatchCategory(typeof(ModManager).Assembly, "");
 
         createManagerBehaviour();
killedBy: RailManager.Tests.Features.TestsBootstrapper.Execute_Calls_Harmony

[Killed] Equality mutation
src/RailManager/Features/Bootstrapper.cs:110:27
 
             var mod = Mod.Create(logger, definition);
             mod.AssemblyPath = assemblyPath;
-            mod.IsValid = result != CompileModResult.Error;
+            mod.IsValid = result == CompileModResult.Error;
 
             mods[i] = mod;
killedBy: RailManager.Tests.Features.TestsBootstrapper.LoadMods_Calls_PluginFactory
