[Killed] String mutation
src/RailManager/Features/CodeCompiler.cs:65:9
     ///     Default set of reference assemblies required by every mod.
     /// </summary>
     public static string[] DefaultReferenceNames => [
-        "Assembly-CSharp",
+        "",
         "0Harmony",
         "Railroader.ModManager.Interfaces",
killedBy: RailManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Failed; RailManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_WithValidModReferences; RailManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Successful

[Killed] String mutation
src/RailManager/Features/CodeCompiler.cs:66:9
     /// </summary>
     public static string[] DefaultReferenceNames => [
         "Assembly-CSharp",
-        "0Harmony",
+        "",
         "Railroader.ModManager.Interfaces",
         "Serilog",
killedBy: RailManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Failed; RailManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_WithValidModReferences; RailManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Successful

[Killed] Negate expression
src/RailManager/Features/CodeCompiler.cs:120:13
         }
 
         var assemblyPath = Path.Combine(definition.BasePath, definition.Identifier + DllExtension);
-        if (fileSystem.File.Exists(assemblyPath)) {
+        if (!(fileSystem.File.Exists(assemblyPath))) {
             var newestFileTime = csFiles.Max(f => f.LastWriteTime);
             if (fileSystem.File.GetLastWriteTime(assemblyPath) >= newestFileTime) {
killedBy: RailManager.Tests.Features.TestsCodeCompiler.CompileMod_AssemblyUpToDate; RailManager.Tests.Features.TestsCodeCompiler.CompileMod_AssemblyUpToDate; RailManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Failed

[Killed] Linq method mutation (Max() to Min())
src/RailManager/Features/CodeCompiler.cs:121:34
 
         var assemblyPath = Path.Combine(definition.BasePath, definition.Identifier + DllExtension);
         if (fileSystem.File.Exists(assemblyPath)) {
-            var newestFileTime = csFiles.Max(f => f.LastWriteTime);
+            var newestFileTime = csFiles.Min(f => f.LastWriteTime);
             if (fileSystem.File.GetLastWriteTime(assemblyPath) >= newestFileTime) {
                 logger.Information("Using existing mod {ModId} DLL at {Path}", definition.Identifier, assemblyPath);
killedBy: RailManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Failed; RailManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Successful

[Killed] Negate expression
src/RailManager/Features/CodeCompiler.cs:122:17
         var assemblyPath = Path.Combine(definition.BasePath, definition.Identifier + DllExtension);
         if (fileSystem.File.Exists(assemblyPath)) {
             var newestFileTime = csFiles.Max(f => f.LastWriteTime);
-            if (fileSystem.File.GetLastWriteTime(assemblyPath) >= newestFileTime) {
+            if (!(fileSystem.File.GetLastWriteTime(assemblyPath) >= newestFileTime)) {
                 logger.Information("Using existing mod {ModId} DLL at {Path}", definition.Identifier, assemblyPath);
                 return CompileModResult.Skipped;
killedBy: RailManager.Tests.Features.TestsCodeCompiler.CompileMod_AssemblyUpToDate; RailManager.Tests.Features.TestsCodeCompiler.CompileMod_AssemblyUpToDate; RailManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Failed

[Killed] Equality mutation
src/RailManager/Features/CodeCompiler.cs:122:17
         var assemblyPath = Path.Combine(definition.BasePath, definition.Identifier + DllExtension);
         if (fileSystem.File.Exists(assemblyPath)) {
             var newestFileTime = csFiles.Max(f => f.LastWriteTime);
-            if (fileSystem.File.GetLastWriteTime(assemblyPath) >= newestFileTime) {
+            if (fileSystem.File.GetLastWriteTime(assemblyPath) < newestFileTime) {
                 logger.Information("Using existing mod {ModId} DLL at {Path}", definition.Identifier, assemblyPath);
                 return CompileModResult.Skipped;
killedBy: RailManager.Tests.Features.TestsCodeCompiler.CompileMod_AssemblyUpToDate; RailManager.Tests.Features.TestsCodeCompiler.CompileMod_AssemblyUpToDate; RailManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Failed

[Killed] Statement mutation
src/RailManager/Features/CodeCompiler.cs:123:17
         if (fileSystem.File.Exists(assemblyPath)) {
             var newestFileTime = csFiles.Max(f => f.LastWriteTime);
             if (fileSystem.File.GetLastWriteTime(assemblyPath) >= newestFileTime) {
-                logger.Information("Using existing mod {ModId} DLL at {Path}", definition.Identifier, assemblyPath);
+                ;
                 return CompileModResult.Skipped;
             }
killedBy: RailManager.Tests.Features.TestsCodeCompiler.CompileMod_AssemblyUpToDate; RailManager.Tests.Features.TestsCodeCompiler.CompileMod_AssemblyUpToDate

[Killed] Statement mutation
src/RailManager/Features/CodeCompiler.cs:128:13
             }
 
             logger.Information("Deleting mod {ModId} DLL at {Path} because it is outdated", definition.Identifier, assemblyPath);
-            fileSystem.File.Delete(assemblyPath);
+            ;
         }
 
killedBy: RailManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Failed; RailManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_WithValidModReferences; RailManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Successful

[Killed] String mutation
src/RailManager/Features/CodeCompiler.cs:131:28
             fileSystem.File.Delete(assemblyPath);
         }
 
-        logger.Information("Compiling mod {ModId} ...", definition.Identifier);
+        logger.Information("", definition.Identifier);
 
         var sources = csFiles.Select(o => o.FullName).ToArray();
killedBy: RailManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Failed; RailManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_WithValidModReferences; RailManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Successful

[Killed] String mutation
src/RailManager/Features/CodeCompiler.cs:135:103
 
         var sources = csFiles.Select(o => o.FullName).ToArray();
 
-        var managedPath = Path.Combine(fileSystem.Directory.GetCurrentDirectory(), "Railroader_Data", "Managed");
+        var managedPath = Path.Combine(fileSystem.Directory.GetCurrentDirectory(), "Railroader_Data", "");
         var references = referenceNames
             .Select(o => Path.Combine(managedPath, o + DllExtension))
killedBy: RailManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Failed; RailManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_WithValidModReferences; RailManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Successful

[Killed] String mutation
src/RailManager/Features/CodeCompiler.cs:135:84
 
         var sources = csFiles.Select(o => o.FullName).ToArray();
 
-        var managedPath = Path.Combine(fileSystem.Directory.GetCurrentDirectory(), "Railroader_Data", "Managed");
+        var managedPath = Path.Combine(fileSystem.Directory.GetCurrentDirectory(), "", "Managed");
         var references = referenceNames
             .Select(o => Path.Combine(managedPath, o + DllExtension))
killedBy: RailManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Failed; RailManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_WithValidModReferences; RailManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Successful

[Killed] Linq method mutation (Concat() to Except())
src/RailManager/Features/CodeCompiler.cs:136:26
         var sources = csFiles.Select(o => o.FullName).ToArray();
 
         var managedPath = Path.Combine(fileSystem.Directory.GetCurrentDirectory(), "Railroader_Data", "Managed");
-        var references = referenceNames
-            .Select(o => Path.Combine(managedPath, o + DllExtension))
-            .Concat(definition.Requires.Keys.Select(o => Path.Combine(Path.Combine(fileSystem.Directory.GetCurrentDirectory(), "Mods"), o, o + DllExtension)))
+        var references = referenceNames
+            .Select(o => Path.Combine(managedPath, o + DllExtension))
+            .Except(definition.Requires.Keys.Select(o => Path.Combine(Path.Combine(fileSystem.Directory.GetCurrentDirectory(), "Mods"), o, o + DllExtension)))
             .ToArray();
 
killedBy: RailManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_WithValidModReferences

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/RailManager/Features/CodeCompiler.cs:143:13
 
         var resources = definition.Resources.Select(o => $"-resource:{Path.Combine(definition.BasePath, o.Value!)},{o.Key}").ToArray();
 
-        if (!compileAssembly(assemblyPath, sources, references.ToArray(), resources)) {
+        if (compileAssembly(assemblyPath, sources, references.ToArray(), resources)) {
             logger.Error("Compilation failed for mod {ModId} ...", definition.Identifier);
             return CompileModResult.Error;
killedBy: RailManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Failed; RailManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_WithValidModReferences; RailManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Successful

[Killed] Statement mutation
src/RailManager/Features/CodeCompiler.cs:144:13
         var resources = definition.Resources.Select(o => $"-resource:{Path.Combine(definition.BasePath, o.Value!)},{o.Key}").ToArray();
 
         if (!compileAssembly(assemblyPath, sources, references.ToArray(), resources)) {
-            logger.Error("Compilation failed for mod {ModId} ...", definition.Identifier);
+            ;
             return CompileModResult.Error;
         }
killedBy: RailManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Failed
