[Killed] String mutation
src/RailManager/Features/CodePatcher.cs:69:28
             return true;
         }
 
-        logger.Information("Patching mod {ModId} ...", definition.Identifier);
+        logger.Information("", definition.Identifier);
 
         bool                success;
killedBy: RailManager.Tests.Features.TestsCodePatcher.ReturnValidInstances; RailManager.Tests.Features.TestsCodePatcher.HandleThrowingPatcher1; RailManager.Tests.Features.TestsCodePatcher.AssemblyLoadFail

[Killed] Equality mutation
src/RailManager/Features/CodePatcher.cs:81:17
 
             var readParameters = new ReaderParameters { AssemblyResolver = resolver };
             assemblyDefinition = assemblyDefinitionStatic.ReadAssembly(assemblyPath, readParameters);
-            if (assemblyDefinition == null) {
+            if (assemblyDefinition != null) {
                 logger.Error("Failed to load definition for assembly {AssemblyPath} for mod {ModId}", assemblyPath, definition.Identifier);
                 success = false;
killedBy: RailManager.Tests.Features.TestsCodePatcher.ReturnValidInstances; RailManager.Tests.Features.TestsCodePatcher.HandleThrowingPatcher1; RailManager.Tests.Features.TestsCodePatcher.AssemblyLoadFail

[Killed] Statement mutation
src/RailManager/Features/CodePatcher.cs:88:21
                 (shouldReplaceOriginal, success) = TryPatchAssemblyDefinition(logger, definition, pluginPatchers, assemblyDefinition);
 
                 if (shouldReplaceOriginal) {
-                    assemblyDefinition.Write(tempFilePath);
+                    ;
                     logger.Debug("Wrote patched assembly to temporary file {TempPath} for mod {ModId}", tempFilePath, definition.Identifier);
                 } else {
killedBy: RailManager.Tests.Features.TestsCodePatcher.ReturnValidInstances; RailManager.Tests.Features.TestsCodePatcher.ReturnValidInstances_NoRequires; RailManager.Tests.Features.TestsCodePatcher.AssemblyReplaceFail

[Killed] Statement mutation
src/RailManager/Features/CodePatcher.cs:89:21
 
                 if (shouldReplaceOriginal) {
                     assemblyDefinition.Write(tempFilePath);
-                    logger.Debug("Wrote patched assembly to temporary file {TempPath} for mod {ModId}", tempFilePath, definition.Identifier);
+                    ;
                 } else {
                     logger.Information("No patches were applied to assembly {AssemblyPath} for mod {ModId}", assemblyPath, definition.Identifier);
killedBy: RailManager.Tests.Features.TestsCodePatcher.ReturnValidInstances; RailManager.Tests.Features.TestsCodePatcher.ReturnValidInstances_NoRequires; RailManager.Tests.Features.TestsCodePatcher.AssemblyReplaceFail

[Killed] String mutation
src/RailManager/Features/CodePatcher.cs:89:34
 
                 if (shouldReplaceOriginal) {
                     assemblyDefinition.Write(tempFilePath);
-                    logger.Debug("Wrote patched assembly to temporary file {TempPath} for mod {ModId}", tempFilePath, definition.Identifier);
+                    logger.Debug("", tempFilePath, definition.Identifier);
                 } else {
                     logger.Information("No patches were applied to assembly {AssemblyPath} for mod {ModId}", assemblyPath, definition.Identifier);
killedBy: RailManager.Tests.Features.TestsCodePatcher.ReturnValidInstances; RailManager.Tests.Features.TestsCodePatcher.ReturnValidInstances_NoRequires; RailManager.Tests.Features.TestsCodePatcher.AssemblyReplaceFail

[Killed] Statement mutation
src/RailManager/Features/CodePatcher.cs:100:17
 
         if (shouldReplaceOriginal) {
             try {
-                fileSystem.File.Delete(assemblyPath);
+                ;
                 fileSystem.File.Move(tempFilePath, assemblyPath);
             } catch (Exception exc) {
killedBy: RailManager.Tests.Features.TestsCodePatcher.ReturnValidInstances; RailManager.Tests.Features.TestsCodePatcher.ReturnValidInstances_NoRequires; RailManager.Tests.Features.TestsCodePatcher.AssemblyReplaceFail

[Killed] Statement mutation
src/RailManager/Features/CodePatcher.cs:101:17
         if (shouldReplaceOriginal) {
             try {
                 fileSystem.File.Delete(assemblyPath);
-                fileSystem.File.Move(tempFilePath, assemblyPath);
+                ;
             } catch (Exception exc) {
                 logger.Error(exc, "Failed to replace original assembly for mod {ModId}", definition.Identifier);
killedBy: RailManager.Tests.Features.TestsCodePatcher.ReturnValidInstances; RailManager.Tests.Features.TestsCodePatcher.ReturnValidInstances_NoRequires; RailManager.Tests.Features.TestsCodePatcher.AssemblyReplaceFail

[Killed] Statement mutation
src/RailManager/Features/CodePatcher.cs:129:9
         resolver.RemoveSearchDirectory(".");
         resolver.RemoveSearchDirectory("bin");
 
-        resolver.AddSearchDirectory(Path.Combine(directory.GetCurrentDirectory(), "Railroader_Data", "Managed"));
+        ;
 
         //  stryker disable once block
killedBy: RailManager.Tests.Features.TestsCodePatcher.ReturnValidInstances; RailManager.Tests.Features.TestsCodePatcher.HandleThrowingPatcher1; RailManager.Tests.Features.TestsCodePatcher.HandleThrowingPatcher2

[Killed] String mutation
src/RailManager/Features/CodePatcher.cs:129:102
         resolver.RemoveSearchDirectory(".");
         resolver.RemoveSearchDirectory("bin");
 
-        resolver.AddSearchDirectory(Path.Combine(directory.GetCurrentDirectory(), "Railroader_Data", "Managed"));
+        resolver.AddSearchDirectory(Path.Combine(directory.GetCurrentDirectory(), "Railroader_Data", ""));
 
         //  stryker disable once block
killedBy: RailManager.Tests.Features.TestsCodePatcher.ReturnValidInstances; RailManager.Tests.Features.TestsCodePatcher.HandleThrowingPatcher1; RailManager.Tests.Features.TestsCodePatcher.HandleThrowingPatcher2

[Killed] Equality mutation
src/RailManager/Features/CodePatcher.cs:138:35
 
         var thisModDir = Path.GetDirectoryName(assemblyPath);
         var modDirs = directory.EnumerateDirectories(Path.Combine(directory.GetCurrentDirectory(), "Mods"))
-                      .Where(o => o != thisModDir)
+                      .Where(o => o == thisModDir)
                       .Where(o => definition.Requires.ContainsKey(Path.GetFileName(o)));
         foreach (var modDir in modDirs) {
killedBy: RailManager.Tests.Features.TestsCodePatcher.ReturnValidInstances; RailManager.Tests.Features.TestsCodePatcher.HandleThrowingPatcher1; RailManager.Tests.Features.TestsCodePatcher.HandleThrowingPatcher2

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/RailManager/Features/CodePatcher.cs:172:29
             }
         }
 
-        return (hasPatch && !hasError, !hasError);
+        return (hasPatch && hasError, !hasError);
     }
 }
killedBy: RailManager.Tests.Features.TestsCodePatcher.ReturnValidInstances; RailManager.Tests.Features.TestsCodePatcher.HandleThrowingPatcher1; RailManager.Tests.Features.TestsCodePatcher.HandleThrowingPatcher2
