[Killed] Equality mutation
RailManager/Features/CodePatchers/MethodPatcher.cs:43:33
         var injected = patcherType.GetMethod(injectorMethod ?? targetMethod, BindingFlags.Public | BindingFlags.Static);
 
         var errors = ValidateInjector<TMarker>(injected).ToList();
-        if (injected == null || errors.Count > 0) {
+        if (injected == null || errors.Count >= 0) {
             throw new ValidationException("Failed to resolve injected method. See errors for details.", errors);
         }
killedBy: RailManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipDuplicatePatch; RailManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; RailManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Equality mutation
RailManager/Features/CodePatchers/MethodPatcher.cs:66:13
         }
 
         var pars = method.GetParameters();
-        if (pars.Length != 1 || !pars[0].ParameterType.IsAssignableFrom(typeof(TMarker))) {
+        if (pars.Length == 1 || !pars[0].ParameterType.IsAssignableFrom(typeof(TMarker))) {
             yield return $"Injected method must have single parameter assignable from {typeof(TMarker)}.";
         }
killedBy: RailManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipDuplicatePatch; RailManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; RailManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] String mutation
RailManager/Features/CodePatchers/MethodPatcher.cs:67:26
 
         var pars = method.GetParameters();
         if (pars.Length != 1 || !pars[0].ParameterType.IsAssignableFrom(typeof(TMarker))) {
-            yield return $"Injected method must have single parameter assignable from {typeof(TMarker)}.";
+            yield return $"";
         }
     }
killedBy: RailManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
RailManager/Features/CodePatchers/MethodPatcher.cs:72:13
     }
 
     private static bool Execute(this PatcherContext ctx, IAssemblyDefinition asm, TypeDefinition type) {
-        if (!ctx.IsApplicable(type)) {
+        if (ctx.IsApplicable(type)) {
             return false;
         }
killedBy: RailManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipDuplicatePatch; RailManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; RailManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Null coalescing mutation (remove left)
RailManager/Features/CodePatchers/MethodPatcher.cs:77:22
         }
 
         var module = asm.MainModule;
-        var method = type.Methods.FirstOrDefault(m => m.Name == ctx.TargetMethod) ?? ctx.CreateOverride(type, module);
+        var method = ctx.CreateOverride(type, module);
 
         if (method == null) {
killedBy: RailManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipDuplicatePatch

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
RailManager/Features/CodePatchers/MethodPatcher.cs:106:13
         var derived = ctx.IsDerivedFromBase(type);
         var marker  = type.Interfaces.Any(i => i.InterfaceType?.FullName == ctx.MarkerType.FullName);
 
-        if (!derived || !marker) {
+        if (derived || !marker) {
             ctx.Logger.Debug(
                 "Skipping patching for type {TypeName}: not derived from {BaseType} or does not implement {MarkerInterface}",
killedBy: RailManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipDuplicatePatch; RailManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; RailManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Bitwise mutation
RailManager/Features/CodePatchers/MethodPatcher.cs:149:21
         }
 
         var baseRef = module.ImportReference(baseMethod);
-        var attrs = (baseMethod.Attributes & ~(MethodAttributes.Final | MethodAttributes.NewSlot)) |
-                    MethodAttributes.HideBySig;
+        var attrs = (baseMethod.Attributes & ~(MethodAttributes.Final | MethodAttributes.NewSlot)) &
+                    MethodAttributes.HideBySig;
 
         var method = new MethodDefinition(ctx.TargetMethod, attrs, module.ImportReference(baseMethod.ReturnType));
killedBy: RailManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; RailManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; RailManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded
