[Killed] String mutation
src/RailManager/Features/ModDefinitionLoader.cs:56:86
     ) {
         var modDefinitions = new Dictionary<string, ModDefinition>(StringComparer.OrdinalIgnoreCase);
 
-        var baseDirectory = Path.Combine(fileSystem.Directory.GetCurrentDirectory(), "Mods");
+        var baseDirectory = Path.Combine(fileSystem.Directory.GetCurrentDirectory(), "");
         if (!fileSystem.Directory.Exists(baseDirectory)) {
             logger.Warning("Mods directory not found at {baseDirectory}", baseDirectory);
killedBy: RailManager.Tests.Features.TestsModDefinitionLoader.SkipsModWithMissingDefinition_AndLogsWarning; RailManager.Tests.Features.TestsModDefinitionLoader.ReturnsEmptyArrayWhenModSDirectoryNotFound; RailManager.Tests.Features.TestsModDefinitionLoader.DuplicateIdentifier_SkipsSecondAndLogsError

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/RailManager/Features/ModDefinitionLoader.cs:57:13
         var modDefinitions = new Dictionary<string, ModDefinition>(StringComparer.OrdinalIgnoreCase);
 
         var baseDirectory = Path.Combine(fileSystem.Directory.GetCurrentDirectory(), "Mods");
-        if (!fileSystem.Directory.Exists(baseDirectory)) {
+        if (fileSystem.Directory.Exists(baseDirectory)) {
             logger.Warning("Mods directory not found at {baseDirectory}", baseDirectory);
             return [];
killedBy: RailManager.Tests.Features.TestsModDefinitionLoader.SkipsModWithMissingDefinition_AndLogsWarning; RailManager.Tests.Features.TestsModDefinitionLoader.ReturnsEmptyArrayWhenModSDirectoryNotFound; RailManager.Tests.Features.TestsModDefinitionLoader.DuplicateIdentifier_SkipsSecondAndLogsError

[Killed] Statement mutation
src/RailManager/Features/ModDefinitionLoader.cs:58:13
 
         var baseDirectory = Path.Combine(fileSystem.Directory.GetCurrentDirectory(), "Mods");
         if (!fileSystem.Directory.Exists(baseDirectory)) {
-            logger.Warning("Mods directory not found at {baseDirectory}", baseDirectory);
+            ;
             return [];
         }
killedBy: RailManager.Tests.Features.TestsModDefinitionLoader.ReturnsEmptyArrayWhenModSDirectoryNotFound

[Killed] String mutation
src/RailManager/Features/ModDefinitionLoader.cs:63:55
         }
 
         foreach (var modDir in fileSystem.Directory.EnumerateDirectories(baseDirectory)) {
-            var definitionPath = Path.Combine(modDir, "Definition.json");
+            var definitionPath = Path.Combine(modDir, "");
             if (!fileSystem.File.Exists(definitionPath)) {
                 logger.Warning("Not loading directory {directory}: Missing Definition.json.", modDir);
killedBy: RailManager.Tests.Features.TestsModDefinitionLoader.DuplicateIdentifier_SkipsSecondAndLogsError; RailManager.Tests.Features.TestsModDefinitionLoader.DetectAnyErrorWhenLoadingDefinitionJson; RailManager.Tests.Features.TestsModDefinitionLoader.DetectInvalidDefinitionJson

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/RailManager/Features/ModDefinitionLoader.cs:64:17
 
         foreach (var modDir in fileSystem.Directory.EnumerateDirectories(baseDirectory)) {
             var definitionPath = Path.Combine(modDir, "Definition.json");
-            if (!fileSystem.File.Exists(definitionPath)) {
+            if (fileSystem.File.Exists(definitionPath)) {
                 logger.Warning("Not loading directory {directory}: Missing Definition.json.", modDir);
                 continue;
killedBy: RailManager.Tests.Features.TestsModDefinitionLoader.SkipsModWithMissingDefinition_AndLogsWarning; RailManager.Tests.Features.TestsModDefinitionLoader.DuplicateIdentifier_SkipsSecondAndLogsError; RailManager.Tests.Features.TestsModDefinitionLoader.DetectAnyErrorWhenLoadingDefinitionJson

[Killed] Statement mutation
src/RailManager/Features/ModDefinitionLoader.cs:65:17
         foreach (var modDir in fileSystem.Directory.EnumerateDirectories(baseDirectory)) {
             var definitionPath = Path.Combine(modDir, "Definition.json");
             if (!fileSystem.File.Exists(definitionPath)) {
-                logger.Warning("Not loading directory {directory}: Missing Definition.json.", modDir);
+                ;
                 continue;
             }
killedBy: RailManager.Tests.Features.TestsModDefinitionLoader.SkipsModWithMissingDefinition_AndLogsWarning; RailManager.Tests.Features.TestsModDefinitionLoader.SkipsModsWithoutDefinition

[Killed] String mutation
src/RailManager/Features/ModDefinitionLoader.cs:65:32
         foreach (var modDir in fileSystem.Directory.EnumerateDirectories(baseDirectory)) {
             var definitionPath = Path.Combine(modDir, "Definition.json");
             if (!fileSystem.File.Exists(definitionPath)) {
-                logger.Warning("Not loading directory {directory}: Missing Definition.json.", modDir);
+                logger.Warning("", modDir);
                 continue;
             }
killedBy: RailManager.Tests.Features.TestsModDefinitionLoader.SkipsModWithMissingDefinition_AndLogsWarning; RailManager.Tests.Features.TestsModDefinitionLoader.SkipsModsWithoutDefinition
