[Killed] Logical mutation
src/RailManager/Features/ModDefinitionValidator.cs:62:28
         foreach (var mod in modDefinitions) {
             // Verify Requirements
             foreach (var (requiredId, fluentVersion) in mod.Requires) {
-                hasError = CheckRequirement(logger, mod, modMap, requiredId, fluentVersion) || hasError;
+                hasError = CheckRequirement(logger, mod, modMap, requiredId, fluentVersion) && hasError;
             }
 
killedBy: RailManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; RailManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; RailManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion

[Killed] Logical mutation
src/RailManager/Features/ModDefinitionValidator.cs:67:28
 
             // Verify Conflicts
             foreach (var (conflictId, fluentVersion) in mod.ConflictsWith) {
-                hasError = CheckConflict(logger, mod, modMap, conflictId, fluentVersion) || hasError;
+                hasError = CheckConflict(logger, mod, modMap, conflictId, fluentVersion) && hasError;
             }
         }
killedBy: RailManager.Tests.Features.TestsModDefinitionValidator.ConflictDetected; RailManager.Tests.Features.TestsModDefinitionValidator.TwoConflicts_OriginalAccumulates_MutantWouldReset; RailManager.Tests.Features.TestsModDefinitionValidator.ConflictWithoutVersion

[Killed] Equality mutation
src/RailManager/Features/ModDefinitionValidator.cs:89:13
             return true;
         }
 
-        if (constraint == null || Satisfies(requiredMod.Version, constraint)) {
+        if (constraint != null || Satisfies(requiredMod.Version, constraint)) {
             return false;
         }
killedBy: RailManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; RailManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; RailManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion

[Killed] Logical mutation
src/RailManager/Features/ModDefinitionValidator.cs:114:13
             return false;
         }
 
-        if (constraint != null && !Satisfies(conflictingMod.Version, constraint)) {
+        if (constraint != null || !Satisfies(conflictingMod.Version, constraint)) {
             return false;
         }
killedBy: RailManager.Tests.Features.TestsModDefinitionValidator.MultipleErrors; RailManager.Tests.Features.TestsModDefinitionValidator.ConflictDetected; RailManager.Tests.Features.TestsModDefinitionValidator.TwoConflicts_OriginalAccumulates_MutantWouldReset

[Killed] Equality mutation
src/RailManager/Features/ModDefinitionValidator.cs:114:13
             return false;
         }
 
-        if (constraint != null && !Satisfies(conflictingMod.Version, constraint)) {
+        if (constraint == null && !Satisfies(conflictingMod.Version, constraint)) {
             return false;
         }
killedBy: RailManager.Tests.Features.TestsModDefinitionValidator.TwoConflicts_OriginalAccumulates_MutantWouldReset; RailManager.Tests.Features.TestsModDefinitionValidator.ConflictWithInstalledModWithValidVersion; RailManager.Tests.Features.TestsModDefinitionValidator.ConflictWithoutVersion
