[Killed] String mutation
src/RailManager/Features/ModExtractor.cs:43:86
     /// </remarks>
     [EditorBrowsable(EditorBrowsableState.Never)]
     public static void ExtractAll(IMemoryLogger logger, IFileSystem fileSystem) {
-        var modsDirectory = Path.Combine(fileSystem.Directory.GetCurrentDirectory(), "Mods");
+        var modsDirectory = Path.Combine(fileSystem.Directory.GetCurrentDirectory(), "");
         var zipFiles      = fileSystem.DirectoryInfo(modsDirectory).EnumerateFiles("*.zip");
 
killedBy: RailManager.Tests.Features.TestsModExtractor.ExtractMods_MoveZipToBackup; RailManager.Tests.Features.TestsModExtractor.SuccessfulExtraction_MovesZipToBackup; RailManager.Tests.Features.TestsModExtractor.ExtractMods_ValidZipWithDefinition_ExtractsToCorrectFolder

[Killed] String mutation
src/RailManager/Features/ModExtractor.cs:44:84
     [EditorBrowsable(EditorBrowsableState.Never)]
     public static void ExtractAll(IMemoryLogger logger, IFileSystem fileSystem) {
         var modsDirectory = Path.Combine(fileSystem.Directory.GetCurrentDirectory(), "Mods");
-        var zipFiles      = fileSystem.DirectoryInfo(modsDirectory).EnumerateFiles("*.zip");
+        var zipFiles      = fileSystem.DirectoryInfo(modsDirectory).EnumerateFiles("");
 
         foreach (var zipFileInfo in zipFiles) {
killedBy: RailManager.Tests.Features.TestsModExtractor.ExtractMods_MoveZipToBackup; RailManager.Tests.Features.TestsModExtractor.SuccessfulExtraction_MovesZipToBackup; RailManager.Tests.Features.TestsModExtractor.ExtractMods_ValidZipWithDefinition_ExtractsToCorrectFolder

[Killed] Statement mutation
src/RailManager/Features/ModExtractor.cs:48:17
 
         foreach (var zipFileInfo in zipFiles) {
             try {
-                TryExtractOne(logger, fileSystem, zipFileInfo, modsDirectory);
+                ;
             } catch (Exception exc) {
                 logger.Error(exc, "Failed to unzip archive {ZipPath}.", zipFileInfo.FullName);
killedBy: RailManager.Tests.Features.TestsModExtractor.ExtractMods_MoveZipToBackup; RailManager.Tests.Features.TestsModExtractor.SuccessfulExtraction_MovesZipToBackup; RailManager.Tests.Features.TestsModExtractor.ExtractMods_ValidZipWithDefinition_ExtractsToCorrectFolder

[Killed] Statement mutation
src/RailManager/Features/ModExtractor.cs:50:17
             try {
                 TryExtractOne(logger, fileSystem, zipFileInfo, modsDirectory);
             } catch (Exception exc) {
-                logger.Error(exc, "Failed to unzip archive {ZipPath}.", zipFileInfo.FullName);
+                ;
             }
         }
killedBy: RailManager.Tests.Features.TestsModExtractor.ExtractMods_InvalidZip; RailManager.Tests.Features.TestsModExtractor.ExtractMods_WhenFailsToOpenZip

[Killed] Statement mutation
src/RailManager/Features/ModExtractor.cs:81:9
     ///     On success, the archive is moved to a <c>.bak</c> backup.
     /// </remarks>
     private static void TryExtractOne(IMemoryLogger logger, IFileSystem fileSystem, IFileInfo zipFileInfo, string modsDirectory) {
-        logger.Information("Processing mod archive {ZipPath} for extraction.", zipFileInfo.FullName);
+        ;
 
         using (var archive = fileSystem.ZipFile.OpenRead(zipFileInfo.FullName)) {
killedBy: RailManager.Tests.Features.TestsModExtractor.ExtractMods_MoveZipToBackup; RailManager.Tests.Features.TestsModExtractor.ExtractMods_ValidZipWithDefinition_ExtractsToCorrectFolder; RailManager.Tests.Features.TestsModExtractor.ExtractionActuallyWritesFiles

[Killed] String mutation
src/RailManager/Features/ModExtractor.cs:81:28
     ///     On success, the archive is moved to a <c>.bak</c> backup.
     /// </remarks>
     private static void TryExtractOne(IMemoryLogger logger, IFileSystem fileSystem, IFileInfo zipFileInfo, string modsDirectory) {
-        logger.Information("Processing mod archive {ZipPath} for extraction.", zipFileInfo.FullName);
+        logger.Information("", zipFileInfo.FullName);
 
         using (var archive = fileSystem.ZipFile.OpenRead(zipFileInfo.FullName)) {
killedBy: RailManager.Tests.Features.TestsModExtractor.ExtractMods_MoveZipToBackup; RailManager.Tests.Features.TestsModExtractor.ExtractMods_ValidZipWithDefinition_ExtractsToCorrectFolder; RailManager.Tests.Features.TestsModExtractor.ExtractionActuallyWritesFiles

[Killed] Statement mutation
src/RailManager/Features/ModExtractor.cs:86:17
         using (var archive = fileSystem.ZipFile.OpenRead(zipFileInfo.FullName)) {
             var definitionEntry = archive.GetEntry("Definition.json");
             if (definitionEntry == null) {
-                logger.Error("Skipping archive {ZipPath}: Missing 'Definition.json'.", zipFileInfo.FullName);
+                ;
                 return;
             }
killedBy: RailManager.Tests.Features.TestsModExtractor.ExtractMods_MissingDefinitionJson_SkipsZipAndLogsError

[Killed] Statement mutation
src/RailManager/Features/ModExtractor.cs:87:17
             var definitionEntry = archive.GetEntry("Definition.json");
             if (definitionEntry == null) {
                 logger.Error("Skipping archive {ZipPath}: Missing 'Definition.json'.", zipFileInfo.FullName);
-                return;
+                ;
             }
 
killedBy: RailManager.Tests.Features.TestsModExtractor.ExtractMods_MissingDefinitionJson_SkipsZipAndLogsError

[Killed] Equality mutation
src/RailManager/Features/ModExtractor.cs:97:17
             }
 
             var modDefinition = TryDeserialize(logger, json, zipFileInfo.FullName);
-            if (modDefinition?.IsValid != true) {
+            if (modDefinition?.IsValid == true) {
                 logger.Error("Skipping archive {ZipPath}: Invalid mod definition.", zipFileInfo.FullName);
                 return;
killedBy: RailManager.Tests.Features.TestsModExtractor.ExtractMods_MoveZipToBackup; RailManager.Tests.Features.TestsModExtractor.SuccessfulExtraction_MovesZipToBackup; RailManager.Tests.Features.TestsModExtractor.ExtractMods_ValidZipWithDefinition_ExtractsToCorrectFolder

[Killed] Boolean mutation
src/RailManager/Features/ModExtractor.cs:97:43
             }
 
             var modDefinition = TryDeserialize(logger, json, zipFileInfo.FullName);
-            if (modDefinition?.IsValid != true) {
+            if (modDefinition?.IsValid != false) {
                 logger.Error("Skipping archive {ZipPath}: Invalid mod definition.", zipFileInfo.FullName);
                 return;
killedBy: RailManager.Tests.Features.TestsModExtractor.ExtractMods_MoveZipToBackup; RailManager.Tests.Features.TestsModExtractor.SuccessfulExtraction_MovesZipToBackup; RailManager.Tests.Features.TestsModExtractor.ExtractMods_ValidZipWithDefinition_ExtractsToCorrectFolder

[Killed] Statement mutation
src/RailManager/Features/ModExtractor.cs:98:17
 
             var modDefinition = TryDeserialize(logger, json, zipFileInfo.FullName);
             if (modDefinition?.IsValid != true) {
-                logger.Error("Skipping archive {ZipPath}: Invalid mod definition.", zipFileInfo.FullName);
+                ;
                 return;
             }
killedBy: RailManager.Tests.Features.TestsModExtractor.ExtractMods_MissingRequiredFields_SkipsZipAndLogsError

[Killed] Statement mutation
src/RailManager/Features/ModExtractor.cs:99:17
             var modDefinition = TryDeserialize(logger, json, zipFileInfo.FullName);
             if (modDefinition?.IsValid != true) {
                 logger.Error("Skipping archive {ZipPath}: Invalid mod definition.", zipFileInfo.FullName);
-                return;
+                ;
             }
 
killedBy: RailManager.Tests.Features.TestsModExtractor.ExtractMods_MissingRequiredFields_SkipsZipAndLogsError

[Killed] Negate expression
src/RailManager/Features/ModExtractor.cs:104:17
 
             var extractPath = Path.Combine(modsDirectory, modDefinition.Identifier);
 
-            if (fileSystem.Directory.Exists(extractPath)) {
+            if (!(fileSystem.Directory.Exists(extractPath))) {
                 logger.Warning("Extraction path {ExtractPath} already exists – skipping mod {ModId}.", extractPath, modDefinition.Identifier);
                 MoveToBackup(zipFileInfo, logger, ".dup", fileSystem.File);
killedBy: RailManager.Tests.Features.TestsModExtractor.ExtractMods_MoveZipToBackup; RailManager.Tests.Features.TestsModExtractor.SuccessfulExtraction_MovesZipToBackup; RailManager.Tests.Features.TestsModExtractor.ExtractMods_ValidZipWithDefinition_ExtractsToCorrectFolder

[Killed] Statement mutation
src/RailManager/Features/ModExtractor.cs:105:17
             var extractPath = Path.Combine(modsDirectory, modDefinition.Identifier);
 
             if (fileSystem.Directory.Exists(extractPath)) {
-                logger.Warning("Extraction path {ExtractPath} already exists – skipping mod {ModId}.", extractPath, modDefinition.Identifier);
+                ;
                 MoveToBackup(zipFileInfo, logger, ".dup", fileSystem.File);
                 return;
killedBy: RailManager.Tests.Features.TestsModExtractor.ExtractMods_ValidZipWithDefinition_SkipIfDestinationFolderExits

[Killed] Statement mutation
src/RailManager/Features/ModExtractor.cs:106:17
 
             if (fileSystem.Directory.Exists(extractPath)) {
                 logger.Warning("Extraction path {ExtractPath} already exists – skipping mod {ModId}.", extractPath, modDefinition.Identifier);
-                MoveToBackup(zipFileInfo, logger, ".dup", fileSystem.File);
+                ;
                 return;
             }
killedBy: RailManager.Tests.Features.TestsModExtractor.ExtractMods_ValidZipWithDefinition_SkipIfDestinationFolderExits

[Killed] String mutation
src/RailManager/Features/ModExtractor.cs:106:51
 
             if (fileSystem.Directory.Exists(extractPath)) {
                 logger.Warning("Extraction path {ExtractPath} already exists – skipping mod {ModId}.", extractPath, modDefinition.Identifier);
-                MoveToBackup(zipFileInfo, logger, ".dup", fileSystem.File);
+                MoveToBackup(zipFileInfo, logger, "", fileSystem.File);
                 return;
             }
killedBy: RailManager.Tests.Features.TestsModExtractor.ExtractMods_ValidZipWithDefinition_SkipIfDestinationFolderExits

[Killed] Statement mutation
src/RailManager/Features/ModExtractor.cs:107:17
             if (fileSystem.Directory.Exists(extractPath)) {
                 logger.Warning("Extraction path {ExtractPath} already exists – skipping mod {ModId}.", extractPath, modDefinition.Identifier);
                 MoveToBackup(zipFileInfo, logger, ".dup", fileSystem.File);
-                return;
+                ;
             }
 
killedBy: RailManager.Tests.Features.TestsModExtractor.ExtractMods_ValidZipWithDefinition_SkipIfDestinationFolderExits

[Killed] Statement mutation
src/RailManager/Features/ModExtractor.cs:110:13
                 return;
             }
 
-            fileSystem.ZipFile.ExtractToDirectory(zipFileInfo.FullName, extractPath);
+            ;
 
             logger.Information("Successfully extracted mod {ModId} from {ZipPath} to {ExtractPath}.", modDefinition.Identifier, zipFileInfo.FullName,
killedBy: RailManager.Tests.Features.TestsModExtractor.ExtractMods_MoveZipToBackup; RailManager.Tests.Features.TestsModExtractor.ExtractMods_ValidZipWithDefinition_ExtractsToCorrectFolder; RailManager.Tests.Features.TestsModExtractor.ExtractMods_NestedZip_SkipsRootAndExtractsCorrectly

[Killed] Statement mutation
src/RailManager/Features/ModExtractor.cs:112:13
 
             fileSystem.ZipFile.ExtractToDirectory(zipFileInfo.FullName, extractPath);
 
-            logger.Information("Successfully extracted mod {ModId} from {ZipPath} to {ExtractPath}.", modDefinition.Identifier, zipFileInfo.FullName,
-                extractPath);
+            ;
         }
 
killedBy: RailManager.Tests.Features.TestsModExtractor.ExtractMods_MoveZipToBackup; RailManager.Tests.Features.TestsModExtractor.ExtractMods_ValidZipWithDefinition_ExtractsToCorrectFolder; RailManager.Tests.Features.TestsModExtractor.ExtractionActuallyWritesFiles

[Killed] Statement mutation
src/RailManager/Features/ModExtractor.cs:116:9
                 extractPath);
         }
 
-        MoveToBackup(zipFileInfo, logger, ".bak", fileSystem.File);
+        ;
     }
 
killedBy: RailManager.Tests.Features.TestsModExtractor.ExtractMods_MoveZipToBackup; RailManager.Tests.Features.TestsModExtractor.SuccessfulExtraction_MovesZipToBackup; RailManager.Tests.Features.TestsModExtractor.ExtractMods_ValidZipWithDefinition_ExtractsToCorrectFolder

[Killed] String mutation
src/RailManager/Features/ModExtractor.cs:116:43
                 extractPath);
         }
 
-        MoveToBackup(zipFileInfo, logger, ".bak", fileSystem.File);
+        MoveToBackup(zipFileInfo, logger, "", fileSystem.File);
     }
 
killedBy: RailManager.Tests.Features.TestsModExtractor.ExtractMods_MoveZipToBackup; RailManager.Tests.Features.TestsModExtractor.SuccessfulExtraction_MovesZipToBackup; RailManager.Tests.Features.TestsModExtractor.ExtractMods_ValidZipWithDefinition_ExtractsToCorrectFolder

[Killed] Negate expression
src/RailManager/Features/ModExtractor.cs:153:16
         var backupPath = basePath;
 
         var i = 1;
-        while (file.Exists(backupPath)) {
+        while (!(file.Exists(backupPath))) {
             backupPath = $"{basePath}{i++}";
         }
killedBy: RailManager.Tests.Features.TestsModExtractor.ExtractMods_MoveZipToBackup

[Killed] PostIncrementExpression to PostDecrementExpression mutation
src/RailManager/Features/ModExtractor.cs:154:39
 
         var i = 1;
         while (file.Exists(backupPath)) {
-            backupPath = $"{basePath}{i++}";
+            backupPath = $"{basePath}{i--}";
         }
 
killedBy: RailManager.Tests.Features.TestsModExtractor.BackupNameCollision_UsesIncrementalSuffix
