[Killed] Negate expression
src/RailManager/HarmonyPatches/ProgrammaticWindowCreatorPatches.cs:41:13
     }
 
     public static void RegisterWindow<TWindow>() where TWindow : ProgrammaticWindowBase {
-        if (_Started) {
+        if (!(_Started)) {
             throw new InvalidOperationException("Cannot register window: Game already started.");
         }
killedBy: RailManager.Tests.HarmonyPatches.TestsProgrammaticWindowCreatorPatches.RegisterWindow_ThrowsAfterStart; RailManager.Tests.HarmonyPatches.TestsProgrammaticWindowCreatorPatches.GetWindow_ThrowsBeforeStart; RailManager.Tests.HarmonyPatches.TestsProgrammaticWindowCreatorPatches.RegisterWindowHandler_UpdateDictionary

[Killed] Statement mutation
src/RailManager/HarmonyPatches/ProgrammaticWindowCreatorPatches.cs:42:13
 
     public static void RegisterWindow<TWindow>() where TWindow : ProgrammaticWindowBase {
         if (_Started) {
-            throw new InvalidOperationException("Cannot register window: Game already started.");
+            ;
         }
 
killedBy: RailManager.Tests.HarmonyPatches.TestsProgrammaticWindowCreatorPatches.RegisterWindow_ThrowsAfterStart

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/RailManager/HarmonyPatches/ProgrammaticWindowCreatorPatches.cs:50:13
     }
 
     public static TWindow GetWindow<TWindow>() where TWindow : ProgrammaticWindowBase {
-        if (!_Started) {
+        if (_Started) {
             throw new InvalidOperationException("Cannot get window: Game not started.");
         }
killedBy: RailManager.Tests.HarmonyPatches.TestsProgrammaticWindowCreatorPatches.GetWindow_ThrowsBeforeStart; RailManager.Tests.HarmonyPatches.TestsProgrammaticWindowCreatorPatches.RegisterWindowHandler_UpdateDictionary; RailManager.Tests.HarmonyPatches.TestsProgrammaticWindowCreatorPatches.GetWindow_ThrowsWhenUnregistered

[Killed] Statement mutation
src/RailManager/HarmonyPatches/ProgrammaticWindowCreatorPatches.cs:51:13
 
     public static TWindow GetWindow<TWindow>() where TWindow : ProgrammaticWindowBase {
         if (!_Started) {
-            throw new InvalidOperationException("Cannot get window: Game not started.");
+            ;
         }
 
killedBy: RailManager.Tests.HarmonyPatches.TestsProgrammaticWindowCreatorPatches.GetWindow_ThrowsBeforeStart

[Killed] String mutation
src/RailManager/HarmonyPatches/ProgrammaticWindowCreatorPatches.cs:51:49
 
     public static TWindow GetWindow<TWindow>() where TWindow : ProgrammaticWindowBase {
         if (!_Started) {
-            throw new InvalidOperationException("Cannot get window: Game not started.");
+            throw new InvalidOperationException("");
         }
 
killedBy: RailManager.Tests.HarmonyPatches.TestsProgrammaticWindowCreatorPatches.GetWindow_ThrowsBeforeStart

[Killed] String mutation
src/RailManager/HarmonyPatches/ProgrammaticWindowCreatorPatches.cs:56:75
 
         var type = typeof(TWindow);
         _RegisteredWindows.TryGetValue(type, out var instance);
-        return instance as TWindow ?? throw new InvalidOperationException($"Cannot find window {type}.");
+        return instance as TWindow ?? throw new InvalidOperationException($"");
     }
 }
killedBy: RailManager.Tests.HarmonyPatches.TestsProgrammaticWindowCreatorPatches.GetWindow_ThrowsWhenUnregistered
