[Killed] String mutation
src/RailManager/JsonConverters/LogEventLevelJsonConverter.cs:33:25
                 if (!Enum.TryParse<LogEventLevel>(raw, true, out var parsed)) {
                     var validValues = Enum.GetValues(typeof(LogEventLevel)).Cast<LogEventLevel>().Select(o => $"'{o}'");
                     throw new JsonReaderException(
-                        $"Unexpected token value '{raw}' when reading {typeof(LogEventLevel?)}. Expected: {string.Join(", ", validValues)} or null");
+                        $"");
                 }
 
killedBy: RailManager.Tests.JsonConverters.TestsLogEventLevelJsonConverter.ReadInvalidValue
