[Killed] Statement mutation
src/RailManager/JsonConverters/ModReferenceJsonConverter.cs:28:9
                 writer.WriteValue(pair.Value.ToString());
             }
         }
-        writer.WriteEndObject();
+        ;
     }
 
killedBy: RailManager.Tests.Features.TestsBootstrapper.LoadMods_Calls_PluginFactory

[Killed] Block removal mutation
src/RailManager/JsonConverters/ModReferenceJsonConverter.cs:39:49
         bool hasExistingValue,
         JsonSerializer serializer
     ) {
-        if (reader.TokenType == JsonToken.Null) {
-            return new();
-        }
+        if (reader.TokenType == JsonToken.Null) {}
 
         var jObject = JObject.Load(reader);
killedBy: RailManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadNullDictionary

[Killed] String mutation
src/RailManager/JsonConverters/ModReferenceJsonConverter.cs:55:21
 
             if (property.Value.Type != JTokenType.String) {
                 throw new JsonSerializationException(
-                    $"Invalid version constraint for mod '{identifier}' in {objectType}. Expected a string.");
+                    $"");
             }
 
killedBy: RailManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadInvalidType

[Killed] Conditional (false) mutation
src/RailManager/JsonConverters/ModReferenceJsonConverter.cs:73:20
 
 
         var (op, skip) = constraint[0] switch {
-            '>' => constraint.Length > 1 && constraint[1] == '='
-                ? (VersionOperator.GreaterOrEqual, 2)
-                : (VersionOperator.GreaterThan, 1),
+            '>' => (false?(VersionOperator.GreaterOrEqual, 2)
+:(VersionOperator.GreaterThan, 1)),
             '<' => constraint.Length > 1 && constraint[1] == '='
                 ? (VersionOperator.LessOrEqual, 2)
killedBy: RailManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; RailManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson

[Killed] Logical mutation
src/RailManager/JsonConverters/ModReferenceJsonConverter.cs:73:20
 
 
         var (op, skip) = constraint[0] switch {
-            '>' => constraint.Length > 1 && constraint[1] == '='
+            '>' => constraint.Length > 1 || constraint[1] == '='
                 ? (VersionOperator.GreaterOrEqual, 2)
                 : (VersionOperator.GreaterThan, 1),
killedBy: RailManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; RailManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; RailManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadInvalidJson

[Killed] Equality mutation
src/RailManager/JsonConverters/ModReferenceJsonConverter.cs:76:20
             '>' => constraint.Length > 1 && constraint[1] == '='
                 ? (VersionOperator.GreaterOrEqual, 2)
                 : (VersionOperator.GreaterThan, 1),
-            '<' => constraint.Length > 1 && constraint[1] == '='
+            '<' => constraint.Length >= 1 && constraint[1] == '='
                 ? (VersionOperator.LessOrEqual, 2)
                 : (VersionOperator.LessThan, 1),
killedBy: RailManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadInvalidJson

[Killed] Logical mutation
src/RailManager/JsonConverters/ModReferenceJsonConverter.cs:80:13
                 ? (VersionOperator.LessOrEqual, 2)
                 : (VersionOperator.LessThan, 1),
             '='                                                                => (VersionOperator.Equal, 1),
-            '0' or '1' or '2' or '3' or '4' or '5' or '6' or '7' or '8' or '9' => (VersionOperator.GreaterOrEqual, 0),
+            '0' or '1' or '2' and '3' or '4' or '5' or '6' or '7' or '8' or '9' => (VersionOperator.GreaterOrEqual, 0),
             _                                                                  => (VersionOperator.Equal, -1)
         };
killedBy: RailManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; RailManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson

[Killed] Logical mutation
src/RailManager/JsonConverters/ModReferenceJsonConverter.cs:80:13
                 ? (VersionOperator.LessOrEqual, 2)
                 : (VersionOperator.LessThan, 1),
             '='                                                                => (VersionOperator.Equal, 1),
-            '0' or '1' or '2' or '3' or '4' or '5' or '6' or '7' or '8' or '9' => (VersionOperator.GreaterOrEqual, 0),
+            '0' or '1' or '2' or '3' or '4' or '5' and '6' or '7' or '8' or '9' => (VersionOperator.GreaterOrEqual, 0),
             _                                                                  => (VersionOperator.Equal, -1)
         };
killedBy: RailManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; RailManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson

[Killed] String mutation
src/RailManager/JsonConverters/ModReferenceJsonConverter.cs:93:13
 
 
         throw new JsonSerializationException(
-            $"Invalid version constraint '{constraint}' for mod '{identifier}'. Expected a valid System.Version or an operator (=, >, >=, <, <=) followed by a version.");
+            $"");
     }
 }
killedBy: RailManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadInvalidJson; RailManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadInvalidJson; RailManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadInvalidJson
