[Killed] Equality mutation
RailManager/src/RailManager/Mod.cs:59:33
 
     /// <inheritdoc />
     public ILogger CreateLogger(string? scope = null) =>
-        logger.ForSourceContext(scope == null ? Definition.Identifier : $"{Definition.Identifier}.{scope}");
+        logger.ForSourceContext(scope != null ? Definition.Identifier : $"{Definition.Identifier}.{scope}");
 
     private string GetSettingsFilePath(string identifier) => Path.Combine(modDefinition.BasePath, identifier + ".json");
killedBy: RailManager.Tests.TestsMod.CreateLogger; RailManager.Tests.TestsMod.CreateLogger
