[Killed] Logical mutation
RailManager/src/RailManager/ModDefinition.cs:55:28
 
     /// <summary> Gets a value indicating whether this mod definition is valid. </summary>
     [JsonIgnore]
-    public bool IsValid => !string.IsNullOrEmpty(Identifier) && !string.IsNullOrEmpty(Name) &&
-                           _IdentifierPattern.IsMatch(Identifier);
+    public bool IsValid => !string.IsNullOrEmpty(Identifier) && !string.IsNullOrEmpty(Name) ||
+                           _IdentifierPattern.IsMatch(Identifier);
     
     private static readonly Regex _IdentifierPattern = new(@"^[a-zA-Z0-9_\-]+$", RegexOptions.Compiled);
killedBy: RailManager.Tests.Features.TestsModExtractor.ExtractMods_MissingRequiredFields_SkipsZipAndLogsError; RailManager.Tests.Features.TestsModDefinitionLoader.SkipsModsWithInvalidDefinition; RailManager.Tests.TestsModDefinition.LoadFromInvalidJson_MissingId

[Killed] String mutation
RailManager/src/RailManager/ModDefinition.cs:58:60
     public bool IsValid => !string.IsNullOrEmpty(Identifier) && !string.IsNullOrEmpty(Name) &&
                            _IdentifierPattern.IsMatch(Identifier);
     
-    private static readonly Regex _IdentifierPattern = new(@"^[a-zA-Z0-9_\-]+$", RegexOptions.Compiled);
+    private static readonly Regex _IdentifierPattern = new("", RegexOptions.Compiled);
 
 }
killedBy: RailManager.Tests.TestsModDefinition.LoadFrom_Identifier
